[{"author": "Susana Montero", "url": "http://www.beeva.com/beeva-view/productividad-empresa/lifelong-learning-o-aprendizaje-continuo-traves-de-moocs/", "image": "http://www.beeva.com/wp-content/uploads/2015/06/BEEVA-moocs-it.jpg", "title": "\n\t\t\t‘Lifelong learning’ o aprendizaje continuo a través de MOOCs\t\t\n\t", "id": 1, "content": "\nNo cabe duda que el aprendizaje continuo debe ser parte integral de nuestra actividad profesional como de nuestra vida y, en particular, en nuestra área de trabajo donde la adopción y aplicación de nuevas tecnologías va cada vez a mayor velocidad.\nEn la era del conocimiento y la tecnología, aprovechar las herramientas y ventajas de la sociedad de la Información para el aprendizaje facilita la generación de nuevos conocimientos, en beneficio de la competitividad y prosperidad de las organizaciones tanto sociales como empresariales.\nEn este artículo se recogen algunas iniciativas de cursos masivos online y abiertos (MOOCs, Massive Open Online Courses) relacionados con perfiles tecnológicos que lideran instituciones de enseñanza superior y empresas relacionadas con el área de las Tecnologías.\nMoocs como formación para perfiles tecnológicos\nLos MOOCs son cursos que surgen como alternativa a las plataformas educativas cerradas, siendo entornos de aprendizaje abiertos, cuyo objetivo es llegar al mayor número de personas posibles, sin requisitos de admisión y de forma gratuita. Para ello, presentan sus contenidos de una forma dinámica y más amena mediante vídeos. También, ofrecen actividades en línea y participación en foros, grupos, etc.\nInicialmente, las universidades y organizaciones se agruparon en diferentes alternativas para ofrecer cursos gratuitos en línea, a través de cursos introductorios, pero debido a que sus principales usuarios ya tenían Estudios Superiores, actualmente están ofreciendo Masters o Especializaciones en conjunción con empresas y, en algunos casos, se pueden conseguir certificados de aprovechamiento por un precio razonable.\nA continuación enumeramos algunas de estas iniciativas.\n¿Dónde podemos adquirir nuevos conocimientos?\nUdacity, es la propuesta más tecnológica a través de sus diferentes Nanodegrees cuyo valor añadido es que los cursos son avalados e impartidos por empresas como Google, AT&T, Facebook, Salesforce, Cloudera, MongoDB, etc. Los recursos son gratis, pero la tutorización de proyectos tienen un coste. Alguno de sus cursos son:\n\nIntro to Hadoop and MapReduce: How to Process Big Data\nData Wrangling with MongoDB\nReal-Time Analytics with Apache Storm\n\nEdx, es una plataforma creada y sustentada por las universidades del MIT y Harvard, y posteriormente se han ido incorporado instituciones de todo el mundo para ofrecer sus cursos, incluso españolas como UC3M, UAM y UPV. Al igual que Udacity, los contenidos son abiertos, pero conseguir un certificado de aprovechamiento tiene un coste. Entre los cursos que podemos encontrar están:\n\nIntroduction to Big Data with Apache Spark\nIntroduction to Cloud Computing\nBuilding Cloud Apps with Microsoft Azure – Part 1\n\nCoursera, es una plataforma que da soporte a universidades de todo el mundo donde pueden ofrecer sus cursos y especializaciones como Data Science, Cloud Computing o Mobile Cloud Computing with Android. Al igual que el resto de sitios, los contenidos son accesibles, pero las especializaciones son de pago. Algunos ejemplos de cursos son:\n\nCloud Computing Applications\nPrincipios de programación funcional en Scala\nProgramación para todos (Python)\n\nMiriadaX, es un proyecto de formación español que aglutina universidades e instituciones de habla hispana, convirtiéndose en un referente europeo. Actualmente existen dos modalidades de diploma: participación o superación. Algunos cursos que se pueden encontrar son:\n\nDesarrollo de servicios en la nube con HTML5, Javascript y node.js\nAprendeR: Introducción al tratamiento de datos con R y RStudio\nDesarrollo en HTML5, CSS y Javascript de WebApps, incl. móviles FirefoxOS\n\nCodeAcademy,es una empresa que tiene como objetivo enseñar a programar e incluye contenidos en español. Se centra en cursos relacionados con lenguajes de programación, cómo aprender a diseñar aplicaciones y sitios web y el uso de APIs para desarrollar tus propias aplicaciones. Ejemplos de estos cursos son:\n\nRuby\nAngularJS\nWePay API (Ruby)\n\nAdemás, algunas empresas para promocionar sus productos o crear marca también se han unido a la moda de ofrecer MOOCs, como: Neo4j, MapR Academy, MongoDB, DataStax.\nTodos estos ejemplos son plataformas donde las instituciones y empresas dan a conocer sus cursos, pero están surgiendo otro tipo de plataformas donde además de poder apuntarte a un curso, cualquiera puede ser instructor, como el caso de Udemy o Skillshare.\nMOOCs y empresas\nLos cursos masivos abiertos online podrían traer importantes cambios en la formación continua en empresas.\nEl integrar los MOOCs como parte de la cultura empresarial puede ser beneficioso para ambas partes. Las empresas al crear MOOCS pueden generar imagen de marca y al utilizar otros ya existentes no duplican esfuerzos en la formación de empleados que cada vez se quedan menos tiempo.\nA los empleados, les aporta un valor añadido en sus curriculums mostrando proactividad y disposición a aprender y pueden ser valorados como parte del aprendizaje permanente dentro de la empresa.\n¿Cual es el tuyo? Si has hecho algún curso comparte tus opiniones.\nImagen: splitshire.com\n", "date": "2015-06-01T11:09:14+00:00", "slug": "\n\t\t\t‘lifelong-learning’-o-aprendizaje-continuo-a-través-de-moocs\t\t\n\t"}, {"author": "Raúl García", "url": "http://www.beeva.com/beeva-view/estrategia-negocio/como-el-big-data-permite-mejorar-tus-finanzas-personales/", "image": "http://www.beeva.com/wp-content/uploads/2015/05/BEEVA-Personal-Financial-Management.jpg", "title": "\n\t\t\tCómo el Big Data permite mejorar tus finanzas personales\t\t\n\t", "id": 2, "content": "\nPara llegar a comprender qué es PFM (Personal Financial Management) es necesario repasar el término Big Data. El Big Data nace por la necesidad de tratar de una forma útil las ingentes cantidades de datos que se encontraban almacenadas a lo largo de años. Y cuando hablamos de ingentes cantidades de datos quizás nos estemos quedando cortos, ya que hoy por hoy, al día se está generando alrededor de 2,5 quintillones de bytes en el mundo.\n1 quintillón = 1 x 1030 = 1,000,000,000,000,000,000,000,000,000,000\nPero, ¿de dónde sale toda esta información? Esta pregunta es más sencilla de responder. Desde tweets, likes en Facebook, ubicaciones geográficas, bases de datos de censos de población, registros médicos, transacciones financieras, niveles de polución, sensores de consumo de energía… En definitiva, hoy en día casi todo lo que hacemos genera información que es almacenada. Partiendo de esta idea nos planteamos: ¿Qué puede hacer una entidad financiera para mejorar sus servicios con esta información? Pues, sin duda, se abren muchas posibilidades para mejorar sus servicios.\nImagen: Centro de Innovación BBVA\nLas principales entidades del mundo llevan años intentando explotar todos los datos generados por transferencias, pagos, préstamos, planes de pensiones, etc, para transformarlos en información útil y obtener un mejor conocimiento de sus clientes que permita llegar a ellos de una forma directa y eficiente.\nVamos a poner un ejemplo que explique esta relación directa. Imaginemos que nuestra entidad financiera recoge información sobre nuestros movimientos. No solo el importe, la fecha y el concepto, sino también la hora de dicho movimiento, si se trata de una compra física el nombre, la dirección e incluso el tipo de actividad de establecimiento. Si se trata de una compra online desde que web se adquiere el producto, la plataforma de pago o incluso la asiduidad de compras online.\nUsando las herramientas adecuadas para procesar todos estos datos, la entidad puede, por ejemplo, categorizar los movimientos, de tal forma que puedas visualizar de una sola vez si se trata de un gasto del hogar, la compra del supermercado o el préstamo de tu coche. Además, te permiten filtrar dichos movimientos por categoría o incluso subcategoría (“quiero ver los gastos del hogar del último año pertenecientes a la luz”). La categorización solo es una pequeña parte del potencial que tiene esta tecnología.\nBajo esa premisa nace el concepto de Personal Financial Management, que permite combinar toda esa información generada con una serie de herramientas y servicios para ayudar a los clientes a tener una visión global de su vida financiera y ayudarles a tener un seguimiento eficiente de sus gastos.\nAdemás, existen otros factores que han hecho necesario la creación de PFM:\n\nEl estado económico a nivel mundial. La crisis ha hecho que los consumidores miren más aún por su dinero, teniendo más cuidado en dónde se va la mayor parte de sus ahorros y, para ello, es indispensable tener capacidad de gestionar tus finanzas personales.\nRecuperación de la confianza. A causa de la crisis financiera, las entidades financieras han encontrado en los canales digitales la forma de acercarse a sus clientes y restablecer esa confianza perdida, poniendo a su disposición las herramientas para facilitar las finanzas personales.\nMayor uso de la banca online. Cada vez estamos más acostumbrados a ver el estado de nuestra cuenta a través de nuestro portátil, tablet o móvil. Además, el uso de operaciones online tales como transferencias o pagos está aumentando día tras día. Esto, sin duda, es clave para agilizar la gestión de nuestras finanzas y tener un seguimiento prácticamente en tiempo real.\n\nImagen: thefinancialbrand.com\nPero para crear un PFM realmente efectivo, no se debe quedar en la superficie de su potencial. Se podría decir que PFM se apoya en tres pilares fundamentales:\n1. Una clara visión del pasado. Permitir al cliente tener una visión total de sus movimientos, depósitos y gastos que ha tenido. Además, se le debería permitir incluir tags en dichas transacciones permitiendo incluso que la herramienta aprenda de estos taggeados y automatizarlos en un futuro. Sería importante permitir desglosar los gastos por tipo o medio de pago.\n2. Socialización. En medio del apogeo de las redes sociales, donde compartimos cualquier instante de nuestra vida, PFM podría plantearse dar a sus clientes la posibilidad de compartir sus gastos, objetivos o presupuestos con otros clientes con perfiles similares (edad, sexo, profesión, estado civil, etc) creando así una especie de red social donde todos los clientes puedan estar interconectados de alguna forma. Además, PFM propone la posibilidad de compartir objetivos o presupuestos con tus amigos, pareja o familiares con los que tengan ese proyecto en común.\n3. Unir pasado, presente y futuro. Un buen análisis de los movimientos del pasado unidos a los gastos y presupuestos en el presente puede predecir cuáles van a ser tus gastos durante el resto del mes y el dinero que te quedará en la cuenta. PFM permitirá además crear objetivos de ahorro o metas y conectarlos con presupuestos y gastos, ver movimientos que se llevarán a cabo, crear alertas y realizar acciones cuando algo determinado ocurra en alguno de tus productos (IFTTT, es decir, If This Then That), recibir recomendaciones para ahorrar o incluso obtener ofertas al realizar compras en ciertos establecimientos, etc.\nPara resumir, Personal Financial Management tiene como objetivo poner al servicio del cliente las herramientas necesarias para tener un control y visión absolutos de su dinero para que así puedan obtener esos ahorros que con la banca tradicional eran más difíciles de conseguir.\nImagen: Free IM Creator / photosteve101\n", "date": "2015-05-26T10:17:20+00:00", "slug": "\n\t\t\tcómo-el-big-data-permite-mejorar-tus-finanzas-personales\t\t\n\t"}, {"author": "Rodrigo Aparicio", "url": "http://www.beeva.com/beeva-view/sistemas/ansible-simplifica-la-gestion-de-la-configuracion-y-automatizacion/", "image": "http://www.beeva.com/wp-content/uploads/2015/05/BEEVA-ansible-automatizacionIT.jpg", "title": "\n\t\t\tAnsible: simplificando la configuración y automatización IT\t\t\n\t", "id": 3, "content": "\nA día de hoy la creación, provisión y despliegue de nuevas máquinas es una tarea diaria, y por lo tanto, no paran de surgir aplicaciones que cubran estas necesidades. Ansible es una aplicación para gestión de la configuración y automatización de tareas IT.\nHasta aquí, podríamos pensar que este problema ya estaba cubierto por dos aplicaciones muy conocidas: Puppet y Chef. Pero el principal problema que nos encontramos al utilizar estas aplicaciones es la complejidad que contienen tanto en lenguaje como en infraestructura.\nAnsible nace con la idea de cubrir estas necesidades, simplificando y facilitando al máximo su integración.\nPrincipales ventajas:\n\nNo utiliza agentes, no utiliza bases de datos, no utiliza demonios.\nSencillez para crear y entender playbooks en lenguaje YAML. (chef:recetas – puppet:modulos)\nGran capacidad de agrupación y/o disgregación de variables, triggers, tasks, roles.\nEjecución lineal de las tareas y fácil comprensión del log generado.\nGestión simple del inventario de máquinas, facilitando la integración con Amazon, OpenStack y RackSpace.\n\nAquí os dejo un ejemplo de infraestructura:\n\nEn este caso hemos decidido generar un playbook por cada capa de servicios: backend y front. Ejecutaremos los playbook mediante un cron y, como paso previo, auto-generaremos el fichero inventario, utilizando el módulo de ansible: ec2.py.\nDe esta forma mantenemos “vivo” el fichero de inventario, no aplicando el playbook a máquinas terminadas e incluyendo todas las máquinas nuevas (auto-escalado).\n¿Alguna experiencia con Ansible que compartir? Si no, espero haber despertado la curiosidad para que probéis esta herramienta.\n \n", "date": "2015-05-21T11:00:30+00:00", "slug": "\n\t\t\tansible:-simplificando-la-configuración-y-automatización-it\t\t\n\t"}, {"author": "Roberto Santiago", "url": "http://www.beeva.com/beeva-view/desarrollo/desarrollo-de-software-te-mueves-o-caducas/", "image": "http://www.beeva.com/wp-content/uploads/2015/05/BEEVA-desarrollo-software.jpg", "title": "\n\t\t\tDesarrollo de software: te mueves o caducas\t\t\n\t", "id": 4, "content": "\n“El mundo ha cambiado.\n Lo siento en el agua.\n Lo siento en la tierra.\n Lo huelo en el aire.”\n“Mucho de lo que era, se ha perdido… pero nadie vive que lo recuerde”\nGaladriel, El señor de los anillos: La comunidad del anillo\n\nEn realidad la situación no es tan trágica pero, ciertamente, el mundo del desarrollo de software ha cogido una velocidad de crucero que hace que sea realmente complicado estar siempre a la última en cuanto a tecnologías y herramientas punteras se refiere.\nAhora todos estamos conectados, sabemos cuales son los stacks tecnológicos que manejan las grandes empresas. Además, estas comparten con la comunidad sus formas de trabajo y de organización interna, se realizan meetups para compartir conocimientos entre los distintos estratos del mundo del desarrollo, hackatones tecnológicos para poner a prueba a los alumnos más aventajados, tenemos a nuestra disposición un sinfín de documentación y a cada paso que damos en una dirección se nos abren diez nuevos caminos.\nSi nos fijamos en el mundo de las aplicaciones web, hasta ahora siempre se había creado desde dos puntos: bien con el stack PHP, frameworks asociados y acceso a base de datos (normalmente mySQL) o con el patrón MVC en Java, delegando todo el negocio en los controladores del framework concreto que se utilizara en Java (Spring, Struts…) y la capa de presentación manejada a base de JSPs con una gran carga de JavaScript (normalmente jQuery).\nAhora ya no nos vale con aplicar lo que llevamos años haciendo, pues han nacido nuevas herramientas que nos facilitan el desarrollo de este tipo de aplicaciones. Contamos con los framework MVC en JavaScript: AngularJS, Ember, Backbone, herramientas para la generación de “plantillas”: Mustache, Marionette, Handlebars e incluso se utiliza JavaScript para crear un servidor web: Node.js.\nAdemás, contamos con herramientas que permiten agilizar todo el proceso de desarrollo como Yeoman, Grunt, Gulp, Bower o compiladores de hojas de estilo como Sass o Less, que hacen que el desarrollo de estilos sea mucho más sencillo y mantenible.\nEn lo que respecta a las bases de datos, siempre habíamos trabajado con los mismos motores: Oracle, mySQL, SQLServer… Pero ahora contamos con bases de datos orientadas a diferentes problemáticas según su uso, las conocidas como NoSQL: MongoDB o CouchDB para documentos; Neo4j o InfiniteGraph para grafos; Redis, Cassandra o Dynamo para almacenamiento de clave-valor…\nImagen: Jktech.com\nA todo esto, por si parece poco, hay que sumarle la explosión del Cloud Computing y el Big Data: nuevas plataformas, nuevos servicios y nuevas herramientas que ayudan a la explotación de los datos. A la cabeza de toda esta revolución se encuentra Amazon Web Services con un catálogo extenso para llevar cualquier tipo de solución a su nube: EC2, S3, Dynamo, Redshift, ELB, EMR… Pero a la zaga se encuentran Google Cloud Computing y Microsoft Azure, cada unos aportando su visión al mundo de la computación en la nube. Cabe decir que estas nuevas plataformas suponen también un nuevo reto para los profesionales dedicados al apartado de Sistemas, ya que tienen que conocer las piezas que conforman cada una de las nubes, cómo administrarlas y cómo hacer que se entienda todo el ecosistema.\n\nSi entramos en el mundo de Big Data hablamos del análisis de datos masivo: ingestas, estructuración, tratamiento, almacenamiento y para ello existen múltiples soluciones en las que navegar, como HDFS, Hadoop, ElasticSearch, Kafka, Spark, Impala, Hive, HBase, Pig, Storm, MapReduce, Zookeeper, Cloudera… Una amalgama de nombres que estructurados de forma correcta logran soluciones rápidas, fiables y flexibles para el tratamiento masivo de los datos.\nComo empezábamos diciendo, estar al día en todos los frentes es algo muy complicado, no solo como individuo sino también como empresa. El empuje hacia proyectos ágiles, efectivos y con objetivos marcados a corto plazo exige un alto dominio de las herramientas y tecnologías para poder dar una respuesta acertada.\nEs por ello que en BEEVA apostamos por la formación, tanto de forma externa como interna, siendo nosotros mismos entre compañeros los que compartimos nuestras experiencias con los demás. De esta forma logramos un triple beneficio: asentar los conocimientos de uno mismo, ampliar los conocimientos de cada compañero que recibe nuestra formación y ampliar el número de profesionales con los que cuenta la compañía en una área concreta.\n\n“Stay hungry, stay foolish”\nSteve Jobs\n\nImage courtesy of mapichai at FreeDigitalPhotos.net\n", "date": "2015-05-19T18:56:49+00:00", "slug": "\n\t\t\tdesarrollo-de-software:-te-mueves-o-caducas\t\t\n\t"}, {"author": "BEEVA", "url": "http://www.beeva.com/beeva-view/ahora-en-beeva/emerging-tech-2015-ciclo-de-master-classes-sobre-big-data/", "image": "http://www.beeva.com/wp-content/uploads/2015/05/BEEVA-emerging-tech-2015.jpg", "title": "\n\t\t\tEmerging Tech 2015: ciclo de master classes sobre Big Data\t\t\n\t", "id": 5, "content": "\nEmerging Tech es un nuevo espacio de encuentro entre profesionales y apasionados de las nuevas tecnologías organizado por U-tad que cuenta con el patrocinio de BEEVA y Price Waterhouse Coopers.\nA lo largo de 2015, Emerging Tech propone un ciclo de Master Classes centradas en el universo de los datos: Big Data, Data Science y Data Visualization. Durante los próximos meses, se llevarán a cabo cinco clases maestras impartidas por expertos en activo en las diferentes áreas, quienes darán claves para dominar los datos y anticiparte a los cambios del sector.\nLos encuentros, se celebrarán en el Centro de Innovación BBVA (Plaza Santa Bárbara 2, Madrid) en horario de 19:00 a 20:00 horas y requieren de registro previo (gratuito).\nDesde BEEVA, os convocamos a las siguientes fechas de este interesante ciclo de conferencias:\n28 de mayo: From (Big) Data to (Big) Value, Richard Benjamins (Director de Grupo BI y BD, responsable de explotación interna a través de Telefónica).\n15 de junio: Data Visualization, Sergio Álvarez (Co-fundador de Vizzuality).\n9 de julio: Machine Learning como nuevo deporte intelectual, José A. Guerrero (Director de IT en Kaggle).\n24 de septiembre: Big Data Walking to the Cloud, César Silgo (Head of Technology en BEEVA).\n1 de octubre: Big Data desde la perspectiva tecnológica, Alberto Marco Bahón (Consultor en tecnologías emergentes).\nToda la información y registro en la web de Emerching Tech.\n", "date": "2015-05-26T15:22:33+00:00", "slug": "\n\t\t\temerging-tech-2015:-ciclo-de-master-classes-sobre-big-data\t\t\n\t"}, {"author": "BEEVA", "url": "http://www.beeva.com/beeva-view/ahora-en-beeva/workshops-sobre-como-consumir-apis/", "image": "http://www.beeva.com/wp-content/uploads/2015/05/BEEVA-workshop-consumir-apis.jpg", "title": "\n\t\t\tWorkshops sobre cómo consumir APIs\t\t\n\t", "id": 6, "content": "\nDesde BEEVA, estamos colaborando con el área Open Innovation de BBVA para la impartición de talleres de contenido práctico sobre el consumo de APIs.\nDurante varias jornadas, en horario de 17:00 a 19:30 horas, en el Centro de Innovación BBVA, se está impartiendo esta formación por parte de varios de los expertos de BEEVA: César Silgo, Luis González, Manuel de Paz y David García Carbayo.\nEl pasado 27 de abril realizamos el taller de nivel básico, en el que se entró a conocer REST: el por qué de su uso, funcionamiento, gestión de errores y conceptos de seguridad aplicados a APIs.\nEl próximo 12 de mayo tendrá lugar un segundo workshop de un nivel más avanzado y en el que se entrará, de forma más práctica, en aprender paso a paso a consumir APIs autenticadas desde el servidor hasta el cliente, gestionando sesiones y utilizando las últimas tecnologías (NodeJS, AngularJS…). Para esta sesión es importante llevar ordenador propio para aprovechar al máximo el taller.\nLas inscripciones están abiertas hasta el día antes del evento en la web del Centro de Innovación BBVA. y sigue el hashtag #WorkshopAPI el día del evento.\n", "date": "2015-05-04T11:42:07+00:00", "slug": "\n\t\t\tworkshops-sobre-cómo-consumir-apis\t\t\n\t"}, {"author": "BEEVA", "url": "http://www.beeva.com/beeva-view/ahora-en-beeva/startup-weekend-54-horas-para-hacer-realidad-las-ideas/", "image": "http://www.beeva.com/wp-content/uploads/2015/04/promo-swmadrid-blog-beeva.png", "title": "\n\t\t\tStartup Weekend Madrid: 54 horas para hacer realidad las ideas\t\t\n\t", "id": 7, "content": "\nLos próximos días 17, 18 y 19 de abril, en GarAJE Madrid vuelve a Startup Weekend, un encuentro en el que más de 100 personas, entre emprendedores, especialistas en marketing, comunicación, desarrolladores y diseñadores, crearán iniciativas empresariales con base tecnológica en un entorno de experimentación pero absolutamente realista gracias al grupo de mentores, expertos y asesores que apoyarán las ideas y proyectos.\nSerán 54 horas de trabajo intensivo y emocionante para vivir, en primera persona, la experiencia de ser emprendedor en una startup.\nStartup Weekend se ha desarrollado en numerosas ocasiones en diferentes ciudades del mundo, dando lugar a proyectos viables y reales. El evento se desarrollará íntegramente en inglés, añadiendo proyección global a los proyectos resultantes.\nLos participantes, inscritos de manera individual o en equipos, podrán desarrollar ideas ya propias o aportar a su talento a alguno de los equipos. Las posibilidades de networking y de encontrar futuros socios en proyectos son enormes al contar con diferentes perfiles profesionales trabajando a la vez.\nDesde BEEVA apoyamos esta edición de Startup Weekend Madrid, apostando por el valor tecnológico de las ideas y de las futuras startups que, sin duda, saldrán de estas jornadas de trabajo.\nMás información e inscripciones en la web Startup Weekend Madrid.\n", "date": "2015-04-07T16:53:06+00:00", "slug": "\n\t\t\tstartup-weekend-madrid:-54-horas-para-hacer-realidad-las-ideas\t\t\n\t"}, {"author": "Marcos Gómez", "url": "http://www.beeva.com/beeva-view/tableros-agiles-cuidado-que-enganchan/", "image": "http://www.beeva.com/wp-content/uploads/2015/05/BEEVA-tableros-agiles1.jpg", "title": "\n\t\t\tTableros ágiles: ¡cuidado que enganchan!\t\t\n\t", "id": 8, "content": "\nDesde hace algo más de medio año, decidimos utilizar las paredes de nuestra oficina para mostrar toda la información relevante que nos pudiera ser útil en el día a día de nuestros proyectos. Después de unos meses utilizando técnicas de Visual Management, he decidido escribir este artículo para explicar cómo nos están ayudando.\nLa Gestión Visual o Visual Management es una práctica que consiste en utilizar distintas técnicas y herramientas de visualización de información, para gestionar trabajo. Tiene como objetivos principales simplificar la comunicación y que la información llegue a todo el mundo de forma ágil y efectiva.\nEn un primer momento, siguiendo los principios del Visual Management, decidimos construir tableros ágiles que mostraban principalmente información y el estado de trabajo que estábamos desarrollando. Cada equipo decidió las diferentes columnas que formaban sus tableros, aunque todo ellos tenían la misma premisa: con un simple vistazo, deberíamos poder conocer el estado actual de cada Sprint (las tareas pendientes, las que se encontraban en curso, las terminadas e incluso las bloqueadas).\nViendo lo mucho que nos aportaban estos tableros, decidimos complementarlos con mucha más información relevante. Ahora, además del estado de las tareas, hay equipos que muestran los bugs detectados, la deuda técnica pendiente, el estado de refinamiento de las tareas candidatas a ser desarrolladas, etc. En definitiva, todo aquello que les sea de utilidad.\nCada equipo tiene así la información que cree más relevante en su pared. En nuestro caso, la nuestra tiene:\n\nUn tablero que contiene tres columnas: Not Started, In Progess, Finished. Este tablero contiene todas las tareas que se van a realizar para cada Sprint. Las columnas indican el estado en el que se encuentra cada una de ellas.\nUn burndown chart que muestra el avance del Sprint, a través de dos líneas: una que indica el número de tareas realizadas y otra que indica los puntos de historia completados, que corresponden con la estimación de las historias de usuario terminadas.\nUn tablero que contiene: los bugs detectados y pendientes de solucionar, las tareas y deuda técnica pendiente de ejecutar, las historias de usuario terminadas pendientes de subir a producción en la siguiente realese y las concesiones al desarrollo que hemos acordado en un momento concreto del proyecto (por ejemplo para aumentar la velocidad de desarrollo si tenemos alguna necesidad extraordinaria)\nEl Definition of Done acordado por el equipo impreso, que todos chequeamos antes de pasar una tarea a la columna finished.\nOtra información relevante para el equipo: información del Sprint (número, fechas, puntos de historia…), versión actual de la aplicación en producción, reuniones pendientes de ser abordadas, etc…\n\nEl uso de estos tableros ágiles nos han aportado grandes beneficios:\n\nNos permiten controlar las diferentes tareas que componen el sprint en curso. Conocemos el trabajo pendiente, en proceso y terminado en cada momento. Cada equipo se encarga de tener actualizados sus tableros y nos hemos dado cuenta que siempre se encuentran más actualizados que las herramientas telemáticas de gestión, que seguimos utilizando para la trazabilidad e histórico de las tareas.\nNos ayudan a conocer en cada momento qué tarea está realizando cada miembro del equipo, ya que en los tableros no solo se especifican las tareas que se encuentran en proceso, sino también la persona o personas que las están realizando.\nNos sirven de guía en las dailys y nos ayudan a crear y adaptar el plan de ejecución diario de las tareas.\nCon solo un vistazo, conocemos en cada momento el estado exacto del sprint y la cantidad de trabajo que nos queda por realizar, por lo que nos podemos hacer una idea de la marcha del mismo.\nCualquier persona que vea el tablero puede conocer el estado de una tarea sin necesidad de interrumpir a nadie. En nuestro caso, que hay tareas de equipos relacionadas con el trabajo de otros, con un vistazo al tablero, puedes saber si tu tarea ya ha sido realizada, si está siendo desarrollada en ese momento, o si sigue a la espera de ser abordada y todo eso sin tener que interrumpir el trabajo de nadie.\nNuestros tableros también reflejan la prioridad de ejecución de las tareas. Esto nos ayuda a elegir la siguiente tarea a ejecutar, que será la tarea con más prioridad pendiente de ser abordada.\nNos otorgan transparencia, ya que cualquier persona que vea el tablero conocerá el estado actual del proyecto. Esto es muy importante para ganar la confianza de las personas relacionadas con el proyecto, que no forman parte del equipo de desarrollo, que verán que no escondemos nada, todo está a la vista.\n\nA la hora de crear tu propio tablero ágil, aquí tienes algunos consejos que pueden serte de utilidad:\n\nMenos es más. Lo que no aporta valor sobra y distrae. Muestra solo información de utilidad e intenta evitar colocar información que distraiga o haga perder el foco de lo realmente importante.\nMantén tu tablero al día, no esperes a la daily para actualizarlo. Tu tablero será infinitamente más útil si muestra información actualizada, ya que todo el mundo sabrá que la información que muestra es 100% confiable.\nColoca tu tablero cerca. Será más fácil mantener tu tablero actualizado, si lo tienes cerca de ti. No tiene sentido que para actualizar la información tengas que recorrer media oficina.\nUtiliza post-it de colores para identificar diferentes tipos de tareas, estados, etc.\nNo te limites a tener solo un tablero por proyecto, puedes crear otros con los items del PBI, bugs pendientes, deuda técnica… todo lo que pueda servirte de ayuda.\nAdapta el tablero a tus necesidades, cada equipo tiene que tener su tablero personalizado.\nCambia tu tablero según lo vayas utilizando para adaptarlo a tus necesidades. Enriquécelo con todo lo que vayas necesitando a lo largo de la vida del proyecto.\n\nAhora que conoces nuestra experiencia con tableros ágiles, ¿te animas a utilizarlos? ¡Perfecto!, pero ten cuidado… ¡¡¡Enganchan!!! Una vez lo utilices, ya no podrás prescindir de él.\n", "date": "2015-05-12T11:48:16+00:00", "slug": "\n\t\t\ttableros-ágiles:-¡cuidado-que-enganchan!\t\t\n\t"}, {"author": "Miguel Angel Villar", "url": "http://www.beeva.com/beeva-view/metodologiasagiles/desarrollo-mobile-first-con-integracion-continua/", "image": "http://www.beeva.com/wp-content/uploads/2015/04/BEEVA-Mobile-First.jpg", "title": "\n\t\t\tDesarrollo Mobile First con integración continua\t\t\n\t", "id": 9, "content": "\nLa fuerte tendencia en las empresas de montar un ecosistema centrado en el móvil provoca la necesidad de ser ágiles a la hora de sacar funcionalidades en el menor tiempo posible y con una calidad excepcional. Para lograr esto, nos tenemos que apoyar en metodologías de desarrollo ágil y herramientas de integración continua.\n\nCon una tecnología multiplataforma Open Source (HTML5, CSS3 y JavaScript) podremos tener presencia en una webApp y una web de escritorio con un único desarrollo, el cual podemos encapsular en diferentes contenedores nativos para poder publicar en los markets como iTunes y Google Play con herramientas como crosswalk.\n\nSi realmente queremos hacer un desarrollo ágil para poder sacar el MVP (Minimum Viable Product) y poder hacer TTM (Time to Market) sacando nuevas releases cada poco tiempo, necesitamos utilizar metodología Scrum e implementar desarrollo dirigido a test ATDD (Acceptance test-driven development). Dentro de cada Scrum Sprint se debe entregar al PO (Product Owner) la funcionalidad desarrollada más los test de aceptación automáticos. Un ejemplo de funcionalidad escrita en Cucumber “Efectivo Móvil” la podemos implementar en Ruby con frameworks Capybara para web y Calaba.sh para apps nativas.\nUna vez validada la funcionalidad por el equipo y el PO, estas .feature de aceptación pasarán a ser regresión e a integrarse con en la app. Para próximas demos de producto sobre nuevas funcionalidades, al lanzarse estas pruebas de regresión, al menos podremos saber que el MVP sigue en perfectas condiciones para poder hacer TTM con la seguridad de que no hemos roto funcionalidades previamente desarrolladas.\n¿Cómo y donde lanzar las pruebas?\nEs necesario que nos apoyemos de herramientas para la IC (integración continua), Bamboo de Atlassian es una herramienta en la que podemos configurar tareas desatendidas por cada cambio en el código fuente de la aplicación. Un ejemplo de planes de trabajo podrían ser:\n\nPlan de Aceptación: donde se por cada commit del desarrollador se lanzarán las pruebas como requisitos de aceptación hasta conseguir un ok para dar por finalizada la tarea del sprint.\nPlan Regresión: donde de forma desatendida y por un conjunto de cambios en el código fuente, se lanzarán todas las pruebas de regresión definidas como requisitos de aceptación en sprints anteriores para saber que la aplicación sigue funcionando con la calidad esperada.\nPromoción de nueva funcionalidad a RC (Release Candidate): en la cual se lanzarán las pruebas de aceptación y regresión de la app antes de mezclarse. En este punto, es cuando los test de aceptación formarán parte de los de regresión para futuras promociones.\nPromoción a Master: después de pasar las pruebas necesarias y validaciones por el equipo y PO, debe existir una tarea donde se publicará la versión RC a Master (producción) para que los clientes puedan disfrutar de las nuevas funcionalidades de la app.\n\n\nGracias a esta metodología y herramientas de IC, en el caso de tener que apagar un fuego en la app, se puede estar en producción en muy poco tiempo con la app probada automáticamente con los requisitos definidos, evitando largas esperas por validación de equipos de testing.\nImagen: IM Creator / Sebastiaan ter Burg\n", "date": "2015-04-22T10:13:02+00:00", "slug": "\n\t\t\tdesarrollo-mobile-first-con-integración-continua\t\t\n\t"}, {"author": "Miriam Orejana", "url": "http://www.beeva.com/beeva-view/metodologiasagiles/user-story-mapping-el-produc-backlog-de-un-vistazo/", "image": "http://www.beeva.com/wp-content/uploads/2015/04/BEEVA-UserProductMap.jpg", "title": "\n\t\t\tUser Story Mapping, el product backlog de un vistazo\t\t\n\t", "id": 10, "content": "\nEstoy programando, me surge una duda, acudo al Product Backlog de mi proyecto y estoy más tiempo buscando la historia de usuario y el criterio de aceptación correspondiente que el que tardo en implementar.\nTengo nuevas ideas para el Product Backlog de mi proyecto, no tengo muy claro dónde incluirlas. Empiezo a leer las historias que entran en la primera release, en la segunda, en la tercera… Me asalta la primera duda: ¿en cuál había metido aquella historia que tanto me encaja junto a esta nueva? La busco, no la encuentro, utilizo el buscador de mi herramienta o de mi editor, la leo, pienso que después de todo quizá vaya mejor en otra release. Repaso otra vez esa release, estoy leyendo las historias y al final ni me acuerdo de lo que estoy buscando. Voy a hacerme un esquema en un folio, que si no, no me aclaro…\n¿Para qué tener un Product Backlog con una pila de historias o funcionalidades bien definidas, ordenadas y priorizadas si luego tenemos tantas que nos perdemos en él? Curiosamente parece que siempre se da más importancia a la buena definición de una historia y sus criterios de aceptación que a la visión del producto como un todo. ¿Por qué? Si, después de todo, lo que estamos construyendo con ellos es un sistema funcional completo que va creciendo con cada release.\nTrabajando con una pila de historias y ordenándola por prioridad es difícil identificar cuáles forman un producto funcional completo o encontrar la historia que buscamos. Hay que tener en cuenta que no solo las historias que aportan más valor constituyen un producto en sí mismo, sino que hay otras de menos valor que sirven de nexo entre ellas y son necesarias para poder ofrecer nuestro producto. Además, repasando este listado de historias, no termina de quedar claro qué hace nuestro software viéndolo como un conjunto, parece que solo obtenemos vistas parciales del mismo. Partimos de una idea inicial con un objetivo claro y a medida que vamos definiéndola parece que vamos perdiendo la visión globalde la misma. Estamos construyendo piezas sí, pero deben encajar y es importante saber cómo lo hacen y, sobre todo, para qué.\nUser Story mapping es una técnica muy sencilla, creada por Jeff Patton, que consiste en organizar el Product Backlog en dos dimensiones. Vamos a ver representadas en una de ellas las releases (horizontal) y en la otra las funcionalidades (vertical). Todo lo que necesitamos es un tablero y tarjetas o papeles que podremos ir moviendo cómodamente a lo largo del mismo. La construcción del mapa no debe ser llevada a cabo por una única persona, lo mejor es que participen distintos perfiles como desarrolladores, diseñadores de interfaces de usuarios, stakeholders o el product owner, para que cada uno aporte su visión y surjan discusiones que permitan aclarar dudas y mejorar la visión del producto. Un buen momento para realizar el mapa sería justo después de la Agile Inception.\nPara construir nuestro mapa podemos seguir los siguientes pasos:\n1. Lo primero es definir nuestros objetivos, para elloescribimos en tarjetas nuestras ideas, a muy alto nivel.\n2. Una vez las tenemos, debemos definir a partir de ellas las funcionalidades que tendrán nuestro producto desde el punto de vista del usuario, deben ser funcionalidades también a alto nivel, generales, las “épicas” o historias muy grandes.\n\nEscribimos cada una en una tarjeta para poder moverla por nuestro mapa tantas veces como sea necesario. Estas funcionalidades deben estar situadas siempre bajo el objetivo para el que se han descrito.\n\n3. Antes de descomponer las épicas en historias más pequeñas, recomiendo distribuirlas a lo largo de la horizontal. Así tenemos nuestra primera foto del sistema. Podéis intercambiar el orden de este paso con el siguiente si os resulta más cómodo y os ayuda a pensar mejor.\n\n¿Cuál ponemos primero? Muy fácil, las que un usuario utilizará primero irán a la izquierda. Por ejemplo, ‘reproducir una lista de canciones’ irá a la derecha de ‘crear una lista de canciones’.\n\n4. A continuación, seguimos escribiendo las tarjetas, tenemos que descomponer las historias más generales en otras más pequeñas, que sean más concretas, deben definir funcionalidades más específicas. Estas son las historias que compondrán nuestras releases, las que iremos cogiendo en cada Sprint y las que se estiman y priorizan. Si siguen siendo grandes, podéis dividirlas cuanto necesitéis.\n\nSobra decir que debemos colocar cada una de las historias debajo de su épica correspondiente y, además, las vamos ordenando de la misma forma, en orden lógico de uso desde el punto de vista del usuario: ¿qué hace mi sistema primero? ¿Cómo se lo explicaría yo a alguien que no sepa nada del proyecto?\n\n5. Terminamos de ordenar las historias desplazándolas a lo largo de la vertical, quedando arriba las más importantes y abajo las más prescindibles.\n\nCuando terminemos de colocar todas las tarjetas en el tablero debemos fijarnos en las historias que tenemos situadas más arriba, éstas definen el conjunto más pequeño de funcionalidades necesarias para tener un producto completo, el mínimo producto viable (MPV). Hay que aclarar que no todas las releases tienen por qué ser puestas en producción, quizá veamos necesario ampliar el producto con alguna release más antes de ello.\n\n6. Después de marcar con una línea horizontal el MPV, tenemos que definir nuestras capas de funcionalidad. Tenemos que hacerlo incluyendo características que juntas constituyan una unidad lógica.\n\nSeguimos trazando líneas horizontales sobre nuestro mapa y así vamos identificando nuestras releases. Si necesitamos mover una historia hacia arriba o abajo para que nuestra release tenga sentido y sea un producto funcional completo, podemos hacerlo.\n\nUser Story Map creado por Steve Rogalsky.\nSi utilizamos User Story Mappingpara representar nuestro Product Backlog, conseguimos un mapa de todo el conjunto del producto, muy visual y directo. Ganamos tiempo, claridad y, con ello, contribuimos a la mejora de calidad.\n\nCon solo un vistazo podemos entender lo que hace nuestro sistema, tenemos todo en una única foto, tanto la idea general como las más específicas.\nNo solo podemos ordenar las historias de forma más cómoda y acertada, sino que también podemos detectar alguna que falte, establecer dependencias entre ellas e incluso identificar mejoras.\nNos da una idea de cuántas releases nos llevará completar el producto.\nSi queremos (o nos piden) incluir para cada una estimaciones a alto nivel, también sabremos cuánto tiempo nos llevará tenerlo preparado. Además esta estimación será más fácil puesto que tenemos todas las historias juntas de forma que podemos comparar unas con otras.\nTambién tenemos definido el orden en el que abordaremos las historias a lo largo de los sprints, será de izquierda a derecha y de arriba abajo.\n\nOs dejo dos links de Patton, el del artículo original It’s all in how you slice y este otro, The new user story backlog is a map.\nImagen: courtesy of Stuart Miles at FreeDigitalPhotos.net\n", "date": "2015-04-20T13:02:28+00:00", "slug": "\n\t\t\tuser-story-mapping,-el-product-backlog-de-un-vistazo\t\t\n\t"}, {"author": "Raúl Herranz", "url": "http://www.beeva.com/beeva-view/desarrollo/genera-workflows-y-pipelines-de-trabajo-con-luigi/", "image": "http://www.beeva.com/wp-content/uploads/2015/05/BEEVA-workflow-luigi.jpg", "title": "\n\t\t\tGenera workflows y pipelines de trabajo con Luigi\t\t\n\t", "id": 11, "content": "\nLuigi es una herramienta de generación de workflows y pipelines de trabajo. Permite definir distintos tipos de tareas, así como las dependencias de ejecución entre ellas, además de disponer de una interfaz de visualización para comprobar el estado de la ejecución y de la finalización del workflow completo. Está escrito en Python, y tiene plantillas predefinidas para varios tipos de tareas.\nEs una herramienta originalmente desarrollada por los ingenieros de Spotify. El proyecto nace para cubrir las necesidades de procesamiento de diversas tareas, estableciendo dependencias entre ellas. Básicamente, con Luigi se pueden generar clases en Python que representan tareas: cargar datos en un HDFS, utilizar un script en R para procesar el contenido de un bucket S3, lanzar una instancia en Amazon y configurarla para que procese varios ficheros y después apagar la instancia, cargar datos en Redshift, mover contenido de MySQL a HDFS, etc.\n\nLuigi – Batch Data Processing in Python from PyData on Vimeo.\nLuigi viene con varias de estas clases ya preparadas para comenzar a usarlas pero, en cualquier momento, se puede generar otras nuevas y añadirlas a la colección para extender la funcionalidad de Luigi. Tan solo hay que escribir el código en Python necesario para establecer tanto la funcionalidad de la tarea como las dependencias asociadas a la misma.\nPermite gestionar la dependencia entre tareas mediante una serie de funciones que se deben reescribir. Las más importantes son las siguiente:\n\nRun. Esta función contendrá el código principal de la tarea que se desea ejecutar.\nRequires. La función requires establece la relación de dependencia entre dos tareas. Así, si la tarea Bar requiere de la tarea Foo, dicha tarea Bar no será ejecutada hasta que haya finalizado por completo la ejecución de la tarea Foo.\nOutput. La función output especifica la referencia al contenido que la tarea genera. Un contenido en un fichero, un directorio nuevo, una ruta en un HDFS… La carpeta _SUCCESS que generan las tareas de Hadoop sería un ejemplo de output. Si lanzamos varias veces el mismo workflow, antes de ejecutar cada una de las tareas, Luigi comprobará que no exista la referencia marcada en el output. En caso de que exista, la tarea se marcará como completada y pasará a la siguiente.\n\n \n Luigi Presentation at OSCON 2013  from Erik Bernhardsson\nEsta herramientas destaca por encima de otras similares porque, mientras que otros gestores de workflows se centran en orquestar trabajos sobre Hadoop / MapReduce (Oozie, Azkaban), Luigi es independiente del trabajo que se desee realizar (también proporciona soporte para tareas que corren sobre clusters de Hadoop, pero no en exclusiva).\nAdemás, aparte de que el código de la aplicación está escrito en Python, el cuerpo de la tarea se programa también directamente en Python, por lo que se puede hacer uso de la flexibilidad y la potencia que nos ofrece este lenguaje para crear y modificar nuevas tareas o partes de la aplicación. Es por esta razón por la que otras compañías, además de Spotify, confían en esta herramienta, como por ejemplo FourSquare, bit.ly o MortarData.\nEl proyecto es open source y se puede encontrar en GitHub.\n", "date": "2015-05-19T11:54:16+00:00", "slug": "\n\t\t\tgenera-workflows-y-pipelines-de-trabajo-con-luigi\t\t\n\t"}, {"author": "Mónica Boto", "url": "http://www.beeva.com/beeva-view/sistemas/instalando-ossec-como-detector-de-intrusos-en-el-host/", "image": "http://www.beeva.com/wp-content/uploads/2015/04/BEEVA-configuracion-ossec.jpg", "title": "\n\t\t\tInstalando OSSEC como detector de intrusos en el host\t\t\n\t", "id": 12, "content": "\nOssec es un proyecto open source dentro de los HIDS, es decir, un detector de intrusos a nivel de host y su función principal es revisar la integridad de los ficheros, aunque es muy configurable al aceptar nuevas reglas creadas por el usuario.\nAparte de la integridad de ficheros, por defecto, analiza logs como el messages, secure, logs de apache, mod_security, nos indica si una máquina está a punto de llenar su espacio en disco o cada vez que se abre o cierra un puerto en nuestra máquina.\nLa verdad, es que tenemos una herramienta muy potente en nuestras manos.\nEn este artículo de hoy, os vamos a enseñar como instalarla de forma sencilla y para que almacene la información en una BBDD MySQL.\nComo información adicional, Ossec puede instalarse como servidor y puede recibir conexiones de agentes instalados en otros equipos.\nEsta instalación se realiza sobre RHEL 6.4\nEn primer lugar instalamos los requisitos que vamos a necesitar:\n\n#yum install gcc php mysql-devel mysql mysql-server\n\nOssec permite que la BBDD esté instalado en una máquina diferente, por lo que no haría falta instalar mysql-server si vais a utilizar uno ya instalado.\nNos descargamos la versión más actual de Ossec:\n\n#wget http://www.ossec.net/files/ossec-hids-2.8.1.tar.gz\n\nDescomprimimos los archivos, lo moveremos a /opt y crearemos un link simbólico para facilitar el uso:\n\n#tar -xvzf ossec-hids-2.8.1.tar.gz\n#cp -R ossec-hids-2.8.1 /opt\n#ln -s ossec-hids-2.8.1/ ossec\n\nAhora procederemos a la instalación de la aplicación y responderemos a las preguntas que vayan apareciendo en pantalla. En este caso, al ser el servidor, indicaremos “servidor” cuando nos pregunten el tipo de instalación y el idioma en que queramos instalar (nosotros hemos seleccionado español).\n\n#cd /opt/ossec/\n#./install.sh\n(en/br/cn/de/el/es/fr/hu/it/jp/nl/pl/ru/sr/tr) [en]: es\n\nAntes de iniciar el proceso, nos advertirá que debemos tener instalado en el sistema un compilador de C.\n1. Nos hace elegir el tipo de instalación: servidor, agente, local o ayuda. En este caso, vamos a elegir Servidor.\n2. Configuramos las variables de entorno de la instalación eligiendo dónde instalar OSSEC HIDS. La haremos en /var/ossec.\n3. Para la configuración del sistema, debemos tener en cuenta lo siguiente:\n\nIndicar nuestro email si queremos recibir notificaciones. Nos detectará el servidor de correo (SMTP) automáticamente y nos preguntará si queremos usarlo.\nAgregar el servicio de integridad del sistema, eligiendo la opción ‘Sí’, y se ejecutará syscheck.\nAgregar el sistema de detección de rootkit, y se ejecutará rootcheck (sistema de detección de rootkit).\nHabilitar respuesta activa. Podemos habilitar el rechazo de servicio o el abandono del paquete por medio de Firewall. El rechazo agregará la IP atacante en el archivo etc/hosts deny, y el abandono  bloqueará la comunicación con el ofendedor en iptables (si el sistema es Linux) o infiltre (si el sistema es Solaris, FreeBSD o NetBSD).\nHabilitar la respuesta desechar en el Firewall, y se activará para niveles >=6.\nPor defecto, en la lista blanca, solo añade la IP del servidor, podemos añadir en este momento mas IPs del entorno añadiendo un espacio entre ellas o bien hacerlo después a través del fichero ossec.conf.\nHabilita syslog remoto (puerto 514 udp).\nSe establecerá la configuración para analizar los siguientes registros:\n\n-- /var/log/messages\n-- /var/log/secure\n-- /var/log/maillog\n-- /var/log/httpd/error_log (apache log)\n-- /var/log/httpd/access_log (apache log)\n\nSi necesitas monitorizar algún otro registro, solo tienes que editar el archivo ossec.conf y agregar una nueva entrada del tipo  , dentro del fichero ossec.conf encontraréis varios ejemplos.\n\n4. A continuación, se iniciará la instalación del sistema y saldrá un mensaje cuando finalice correctamente.\nPodrás comenzar OSSEC HIDS: /var/ossec/bin/ossec-control start\nPodrás detener OSSEC HIDS: /var/ossec/bin/ossec-control stop\nPodrás modificar que la configuración pueda ser leída o modificada: /var/ossec/etc/ossec.conf\n5. Tras realizar esta instalación, te pregunta sobre la conexión del agente con el servidor, para lo que hay que agregar cada uno de los agentes. Para ello hacemos que se ejecute el programa ‘manage_agents’, lo que nos permitirá agregar o borrar: /var/ossec/bin/manage_agents\nEste paso finaliza la instalación de Ossec y comenzará a registrar los accesos y cambios. Antes de continuar, hay un par de apuntes que debéis tener en cuenta:\n\nEn la parte de correo, se ha detectado que no funciona bien usando el smtp de google, suele bloquear los mensajes, por lo que os recomendamos que uséis el local del servidor (postfix, sendmail, etc.).\nEn la respuesta activa, mucho cuidado a que en los logs, de apache, mod_security, etc., se visualice correctamente la IP de origen, sobre todo si usáis HTTPs, ya que os podéis arriesgar a que os bloquee un balanceador o máquina externa que os pueda provocar hasta pérdida del servicio. Os recomendamos que realicéis el máximo número de pruebas que podáis.\n\nSoporte para BBDD\nAhora procederemos a instalar el soporte de OSSEC para BBDD. Anteriormente hemos debido instalar el cliente de MySQL, ya que es necesario para esta parte de la instalación.\nNo se va a explicar la instalación de MySQL pero sí os indicamos la creación de la BBDD y del usuario con los permisos que necesita:\n\nmysql -u root -p\nmysql> create database ossec;  *Creamos la bbdd\nmysql> grant INSERT,SELECT,UPDATE,CREATE,DELETE,EXECUTE on ossec.* to ossecuser@ identified by\n   * Creamos el usuario.\nmysql>flush privileges;\nmysql> quit\n\nAhora, importamos el esquema de la BBDD que nos proporciona OSSEC para almacenar la información:\n\n#mysql -u root -p ossec \nEste esquema se encuentra dentro de la ruta del instalable en /opt/src/os_dbd.\nA continuación, configuramos el fichero ossec.conf que se encontrará en /var/ossec/etc/ossec.conf y añadimos la sección de la BBDD.\n\n\n\nip o hostname de la bbdd\nnombre usuario de la bbdd\npassword bbdd\n        ossec\nmysql\n\n\n\n*elimina los espacios entre corchete () y texto.\nActualizamos OSSEC con la configuración para permitir BBDD, vamos a la ruta del instalador y ejecutamos lo siguiente:\n\n# cd /opt/ossec\n# cd src\n#make setdb\n#cd ..\n# ./install.sh\n\nLe decimos que solo queremos actualizar la aplicación instalada.\nUna vez configurado, ejecutamos los comandos necesarios para que los cambios tengan efecto:\n\n# /var/ossec/bin/ossec-control enable database\n# /var/ossec/bin/ossec-control restart\n\nSi todo está bien configurado, se iniciará Ossec correctamente y podremos utilizar los comandos de inicio y parada del servicio normales.\n\n#/etc/init.d/ossec start\n#/etc/init.d/ossec stop\n\nEspero que os guste OSSEC tanto como a nosotros y que investiguéis todo su potencial.\nOs dejamos información de la web de OSSEC y de la lista de correo. Para cualquier duda, dejadnos un comentario  \n", "date": "2015-04-27T12:02:02+00:00", "slug": "\n\t\t\tinstalando-ossec-como-detector-de-intrusos-en-el-host\t\t\n\t"}, {"author": "Juan José Garoz", "url": "http://www.beeva.com/beeva-view/sistemas/desenredando-logs-con-logstash/", "image": "http://www.beeva.com/wp-content/uploads/2015/03/BEEVA-logs-tools.jpg", "title": "\n\t\t\tDesenredando logs con Logstash\t\t\n\t", "id": 13, "content": "\nCada vez que se produce un error en una arquitectura de sistemas la primera cosa que un administrador tiene que hacer es comprobar los logs relativos a la aplicación, dado que los logs pueden mostrar información acerca del problema o del volumen de información que se esta tratando.\nSi solo se están administrando unos cuantos servidores y aplicaciones, entonces basta con hacer un grep de los registros para filtrar y recopilar información. Pero en una situación en la que hay cientos de servidores y muy diferentes tipos de aplicaciones que se ejecutan en ellos, no se puede ir máquina por máquina filtrando y parseando los logs en la forma en la que queremos visualizar la información.\nEl problema se puede resolver mediante la utilización de un servidor centralizado de logs. Pero incluso teniendo un lugar centralizado de registros, puede ser problemático la búsqueda de un error en cientos de megas de registros y buscar un patrón de aparición del mismo.\nSerá mejor si tenemos en el servidor centralizado de logs una herramienta que nos permita filtrar, organizar y visualizar esos logs de una forma ordenada y que se ajuste a nuestras necesidades.\nAfortunadamente, existe una herramienta de código abierto disponible que puede ayudar a resolver nuestro problema. La herramienta se llama Logstash.\nLogstash es libre, también su código abierto y se distribuye bajo licencia Apache 2. Es una solución de gestión de registros muy eficiente. La ventaja principal es que mediante una serie de plugins de entrada, filtros y plugins de salida nos permite tratar logs o eventos de multitud de dispositivos y morfologías. Algunos de los plugins existentes y que continuamente se incrementan son los siguientes:\n\nUn ejemplo sencillo de cómo se puede utilizar Logstash para filtrar los diferentes eventos que se producen a nivel del sistema es con la siguiente configuración:\ninput {\ntcp {\nport => 514\ntype => syslog\n}\nudp {\nport => 514\ntype => syslog\n}\n}\nfilter {\nif [type] == \"syslog\" {\ngrok {\nmatch => { \"message\" => \"<%{POSINT:syslog_pri}>%{SYSLOGTIMESTAMP:syslog_timestamp} %{SYSLOGHOST:syslog_hostname} %{DATA:syslog_program}(?:\\[%{POSINT:syslog_pid}\\])?: %{GREEDYDATA:syslog_message}\" }\n}\n}\n}\noutput {\nelasticsearch { }\n}\n\nComo podemos observar, tenemos tres partes bien diferenciadas: entrada (input), donde escuchamos mediante el puerto TCP, UDP los eventos que nos lleguen; filtro (filter) donde parseamos o troceamos el mensaje; y salida (output) donde almacenamos todos los eventos en este caso en un elasticsearch que nos permita posteriormente realizar una búsqueda.\nFinalmente mediante una herramienta como pueda ser Kibana, o cualquier frontal que sea capaz de realizar consultas sobre un elasticsearch, puede mostrarse los resultados.\n\n¿Alguna experiencia que compartir desenredando logs o con Logstash?\nImagen: wikimedia.org\n", "date": "2015-03-23T12:15:27+00:00", "slug": "\n\t\t\tdesenredando-logs-con-logstash\t\t\n\t"}, {"author": "Mario Molina", "url": "http://www.beeva.com/beeva-view/desarrollo/conoce-las-ventajas-del-lenguaje-google-apps-script/", "image": "http://www.beeva.com/wp-content/uploads/2015/04/BEEVA-Google-Apps-Script.jpg", "title": "\n\t\t\tConoce las ventajas del lenguaje Google Apps Script\t\t\n\t", "id": 14, "content": "\nGoogle Apps Script es un lenguaje basado en JavaScript que puede ser utilizado tanto para el desarrollo de macros, funciones y complementos para los servicios de Google Apps (Documents, Spreadsheet y Forms) como para la creación de aplicaciones web.\nLa sintaxis es prácticamente idéntica a la de JavaScript por lo que si, ya se tienen conocimientos de este lenguaje, su curva de aprendizaje es muy baja. Además, Google ofrece una serie de APIs para poder interactuar con sus servicios como Calendar, Gmail, Drive, etc. con los que potenciar la funcionalidad de nuestros desarrollos.\nUna de las ventajas que presenta es que la ejecución de los scripts se produce en los servidores en la nube de Google y no en el lado del cliente, donde se ejecuta el código HTML, el CSS y los posibles scripts de JavaScript que se implementen.\nEntorno de trabajo\nGoogle ofrece un entorno web para el desarrollo de los scripts accesible desde la dirección script.google.com. Todos los ficheros creados se almacenan en la nube, concretamente en nuestra cuenta de Google Drive, pudiendo por tanto trabajar desde cualquier lugar con una conexión a Internet.\nEste entorno tiene gran parte de las funcionalidades que ofrecen otros IDEs como es hacer debug, ver logs, inclusión de bibliotecas o buscar a través de todos los archivos que componen el proyecto,  así como la creación de una manera fácil y rápida de activadores para ejecutar procesos de manera periódica.\nLa cantidad de servicios que nos ofrece Google es muy amplia y podemos beneficiarnos de la potencia de estos para desarrollar nuestros scripts. Todas las APIs necesarias para usarlos, 11 en total, ya vienen integradas en el entorno de desarrollo y, por tanto, no hace falta importar ninguna librería para utilizarlas.\nExtendiendo los servicios de Google\nPodemos crear nuestros propios complementos a través del menú Herramientas > Editor de secuencia de comandos de Documents y de Spreadsheet. En el primer paso nos abrirá un diálogo que nos pregunta qué tipo de complemento queremos crear y, después, nos reenviará al entorno de desarrollo en el que trabajar.\nUna vez creado un complemento, puede ser publicado y descargado a través de la plataforma propia que ofrece Google. Estos complementos pueden ser instalados bien por cualquier usuario con una cuenta de Google o bien pueden ser restringidos tan solo para los usuarios de un dominio concreto.\nCon esto podemos añadir funcionalidades a los servicios, como por ejemplo la creación de gráficos con los datos obtenidos a través un formulario de Google Forms, el envío automático de un fichero a través de correo electrónico para todos los usuarios que aparezcan en una hoja de cálculo o traducir el texto de un documento de Google Docs.\nMenús personalizados y macros\nA los menús por defecto que tienen Documents y Spreadsheet podemos añadirles nuevas funciones que ejecuten una serie de instrucciones, llamadas macros, previamente definidas. Las nuevas acciones aparecerán como un nuevo submenú bajo el menú principal ‘Complementos’.\nEn el caso de las hojas de cálculo podemos definir funciones que después podemos utilizar del mismo modo que las fórmulas clásicas predefinidas en estas hojas. Por ejemplo, si creamos una función para transformar de metros a millas necesitamos:\n1. Crear una función con Apps Script desde Herramientas→ Editor de secuencia de comandos y en el diálogo elegir ‘Proyecto en blanco’.\n2. Crearemos un función de la forma.\nfunction metrosamillas(metros) {\n if (typeof metros!= ‘number’) {\n   return null;\n }\n return metros/ 1000 * 0.621371;\n}\n3. Guardar el nuevo documento.\n4. Recargar la página del Spreadsheet y usar la fórmula de la misma forma que las predefinidas, por ejemplo:  “=metrosamillas(A1)”\nGalería de complementos\nComo ya se ha comentado, los servicios Documents y Spreadsheet permiten la instalación de complementos creados con Google Apps Script de la misma forma que muchos navegadores webs. Tan solo debemos acceder desde algún documento u hoja de cálculo al menú Complementos > Obtener Complementos y se nos abrirá una ventana similar a la de Chrome Store desde la que elegir el complemento que necesitemos. Una vez instalado, accederemos a él desde el menú ‘Complementos’.\nCreación de aplicaciones con Google Sites y App Script\nDe una forma muy similar a la creación de los complementos podemos realizar aplicaciones web a través de Google Sites y Apps Script. Por un lado tendremos la parte cliente, es decir, archivos HTML y CSS. Por otra, tendremos un archivo con extensión “gs” que es donde incluiremos los scripts a ejecutar, de la misma manera que lo hacemos cuando se trata de un archivo de JavaScript.\nLas llamadas a las funciones del fichero “gs” deben realizarse a través de JavaScript. Pero no crearemos archivos “js”, si no que se realiza desde uno HTML insertando el código entre etiquetas  … \nHay que tener en cuenta que la ejecución de los scripts se realizan en un servidor en la nube y no en el cliente, por lo que es necesario controlar las llamadas asíncronas que se producen. \nPara poder llamar a una función desde el cliente al servidor debemos hacerlo a través de la sentencia:\ngoogle.script.run.withSuccessHandler(tratarResultado).funcionAEjecutar(parámetros);\no bien:\ngoogle.script.run.funcionAEjecutar(parámetros);\nEn ambos casos se ejecutará la función “funcionAEjecutar” que se debe encontrar definida en el archivo “gs” al igual que se hace en JavaScript: function funcionAEjecutar(parámetros){…}\nUna vez se devuelva el control a la parte cliente, en el primer ejemplo, se ejecutará automáticamente la función “tratarResultado” del JavaScript local, pasándole como parámetros lo devuelto en el return de la función ejecutada en servidor. Sin embargo en el segundo caso no se llamará a ninguna función del cliente y perderemos los posibles valores devueltos.\nPara terminar os dejo algunos enlaces de interés. Desde Google Developers nos ofrecen una web con ejemplos e información para trabajar con Apps Script. Los principales apartados son:\n\nGuías para empezar a utilizar Apps Script en la creación de complementos para sus servicios.\nDesarrollo de aplicaciones webs.\nAPIs de los servicios.\n\nImagen: Creative Commons / Almonroth\n", "date": "2015-04-14T12:26:49+00:00", "slug": "\n\t\t\tconoce-las-ventajas-del-lenguaje-google-apps-script\t\t\n\t"}, {"author": "Francisco Gómez", "url": "http://www.beeva.com/beeva-view/innovacion/inteligencia-ambiental-el-entorno-se-adapta-al-ser-humano/", "image": "http://www.beeva.com/wp-content/uploads/2015/02/BEEVA-tecnologia-futuro.jpg", "title": "\n\t\t\tInteligencia ambiental: el entorno se adapta al ser humano\t\t\n\t", "id": 15, "content": "\nLa tendencia actual en la evolución de la web pone en voga de toda la comunidad una gran variedad de sujerentes términos como Internet de las cosas (IoT), Inteligencia Ambienal (Aml), Computación ubicua, Pervasive computing o Everyware, que bien podrían ser vistos como diferentes enfoques de un mismo paradigma: la integración de la informática en nuestro entorno cotidiano de manera transparente.\nEste concepto propone la creación de entornos inteligentes que se adapten a las necesidades, gustos e intereses de la gente que vive en ellos, ayudando a llevar a cabo sus tareas diarias mediante la integración de la informática en el entorno de la persona, de forma que los ordenadores no se perciban como objetos diferenciados.\nUn ejemplo de aplicación la tendríamos en los frigoríficos que son conscientes de su contenido cuando ha sido convenientemente etiquetado, pudiendo entonces ser capaces de planificar menús saludables para toda la semana en función de las necesidades de cada miembro de la familia, informar del estado de caducidad de la comida e incluso autogestionar las comprar con el supermercado.\nEvolución tecnológica: Internet de las ideas\nTodo empieza por la necesidad de acceso a la información. Mediante avances como la imprenta, la televisión, el teléfono y luego Internet, siempre ha existido esa necesidad de transmitir y, como piedra angular de todo ello, el lenguaje, es decir, modelar el conocimiento, hacer tangibles las ideas.\nAunque desde sus inicios, Tim Berners-Lee ya quiso concebir la web como algo cargado de contenido semántico, no fue hasta muchos años más tarde con la irrupción de la web 2.0 cuando el nivel de difusión y distribución de la información aumentó desmesuradamente. Empezó a acuñarse este término para distinguir la necesidad de gestionar el conocimiento entre tanta cantidad de información presente en la red.\nCon la web 3.0 se ofrecen nuevas posibilidades orientadas a conseguir una web semántica, es decir, publicar datos legibles por las máquinas. La web semántica se basa en la idea de mejorar la interacción entre las aplicaciones web usando una comunicación más interpretable gracias a la definición de metadatos y ontologías, evitando así, cada vez en mayor medida, la intervención humana.\nPor tanto, nos vamos acercando más y más a un mundo dominado por las ideas, incluso ya se habla de Internet of Thoughts o Internet of Sense, eliminando cada día más nuestras limitaciones naturales, delegando a las máquinas estos asuntos mediante interfaces cada vez más cercanas a las personas.\nAplicaciones de la inteligencia ambiental\nComo os podéis imaginar las aplicaciones son infinitas, por citar algunos ejemplos:\nAccesibilidad. La Universidad Politécnica de Madrid (UPM) desarrolla unas gafas sensibles al contexto para que las personas sordas puedan ver las películas en los cines subtituladas.\nSmart cities. Cerca de Seul se ha construido la ciudad ubicua de New Songdo City, donde todos los sistemas de información están interconectados y las computadoras están integradas en las viviendas, las calles y los edificios de oficinas. La mayoría de los servicios (gestión de residuos, luminaria, aguas) están automatizados.\nTurismo. Será posible viajar por todo el mundo y, al contemplar un paraje natural, automáticamente conseguir toda la información relativa a ese escenario en cualquier dispositivo que llevemos.\nMundos virtuales. En un futuro, los mundos virtuales serán algo muy habitual gracias a la evolución de interfaces más intuitivas y la mayoría de las personas tendrán una vida virtual paralela a la real. ¿Se confundirá realidad con ficción?\nMedicina. Ya en algunos casos podemos usar el telediagnóstico a través de Internet, con las mismas garantías médicas que en la actualidad se hace de forma presencial.\nSalud. Podremos monitorizar al instantes nuestras constantes y conocer lo que nuestro cuerpo necesita en cada momento, ajustar tanto la medicación como nuestro estilo de vida a diario, detectar riesgos, etc.\nHogar. Aunque ya hay algunos ejemplos en la actualidad, en un futuro no muy lejano la mayoría de los hogares tendrán todos sus sistemas multimedia y electrodomésticos conectados a la Red. Así, por ejemplo, los refrigeradores podrán conocer su propio contenido y mostrar recetas en función del mismo.\nTransporte. Los automóviles, también conectados a Internet, reconocerán dónde están e interrogarán a ciertas bases de datos preguntas tales como “¿dónde está el restaurante más cercano y qué tienen en el menú?”\nPodemos citar también algunas áreas que están actualmente en investigación:\n\nSensores RFIDs.\nNuevas generaciones de redes para el soporte del cómputo ubicuo (Internet 2, redes adhoc, redes de sensores).\nUso de metalenguajes (RDF, OWL).\nAplicaciones móviles basadas en sistemas distribuidos y en sistemas peer-to-peer.\n\nComo ya podemos comprobar, porque es una realidad, quienes disfrutamos con la tecnología tenemos por delante un apasionante tiempo de transformación tecnológica de la vida cotidiana.\nImagen: freedigitalphotos.net / hyena reality\n", "date": "2015-02-11T11:13:56+00:00", "slug": "\n\t\t\tinteligencia-ambiental:-el-entorno-se-adapta-al-ser-humano\t\t\n\t"}, {"author": "Roberto Alcalde", "url": "http://www.beeva.com/beeva-view/innovacion/el-algoritmo-de-google-capaz-de-resolver-el-99-de-los-captchas/", "image": "http://www.beeva.com/wp-content/uploads/2015/02/BEEVA-recaptcha-google.jpg", "title": "\n\t\t\tEl algoritmo de Google capaz de resolver el 99% de los captchas\t\t\n\t", "id": 16, "content": "\n¿Quién puede decir que nunca ha fallado al insertar un captcha en alguna ocasión? Que levante la mano quien no haya pulsado F5 para refrescar una imagen captcha por que no era capaz de adivinar lo que realmente ponía. Pues todo esto se lo debemos a Luis von Ahn, su creador, y ahora debemos agradecer a Google que queriendo desarrollar un algoritmo para la identificación automatizada de los números de las casas en las imagenes, ha descubierto un algoritmo que identifica el 99% de esos puzzles y letras “ebrias” que nos ponen como “trampa” en Internet.\nHace algunos meses, Google publicó un informe explicando cómo había creado un algoritmo de reconocimiento de imagen capaz de identificar los números de portales y casas en Street View. Las imágenes de abajo son algunos de los reCAPTCHAS que el algoritmo fue capaz de solucionar sin problema.\n\nEste sistema le permite asociar de forma automática el número de una casa con su ubicación geográfica exacta y, cuando analiza las imágenes de Street View, lo hace una precisión realmente aceptable, reconoce los textos el 90% de las veces y un 96% cuando se trata de los números de las casas.\n\n¿Qué implicaciones tiene todo esto? Google asegura que ha tenido esto en cuenta para mejorar la seguridad de sus CAPTCHAS. El año pasado ya redujo la distorsión de las palabras para hacerlos más fácil de identificar y añadió otros factores como la forma en la que navegamos por la página para discernir si al otro lado hay un humano o no. Por supuesto, no da muchos más detalles de cómo los va a hacer más seguros gracias a este pequeño descubrimiento.\n“Gracias a esta investigación nos dimos cuenta que distorsionar el texto no es suficiente”, afirmó uno de los autores de la investigación.\nNos lo seguirán poniendo difícil.\nImagen: gizmag.com\n", "date": "2015-02-03T10:54:30+00:00", "slug": "\n\t\t\tel-algoritmo-de-google-capaz-de-resolver-el-99%-de-los-captchas\t\t\n\t"}, {"author": "Enrique Otero", "url": "http://www.beeva.com/beeva-view/innovacion/deep-learning-el-resurgir-de-las-redes-neuronales/", "image": "http://www.beeva.com/wp-content/uploads/2015/02/BEEVAlabs-deep-learning.jpg", "title": "\n\t\t\tDeep Learning, el resurgir de las redes neuronales\t\t\n\t", "id": 17, "content": "\nDentro del área de los sistemas de aprendizaje automático el concepto de Deep Learning está cobrando auge en los últimos años. Para entender qué supone este concepto debemos entender primero los fundamentos y limitaciones actuales de los sistemas de aprendizaje automático o Machine Learning.\nHabitualmente, cuando se describen los principales algoritmos de aprendizaje automático, suelen dividirse en dos categorías: aprendizaje supervisado y aprendizaje no supervisado.\nLas técnicas de aprendizaje no supervisado buscan encontrar estructura o patrones ocultos en los datos, y se emplean por ejemplo en problemas de segmentación o clustering. Mientras que los algoritmos de aprendizaje supervisado resultan más eficaces para la resolución de problemas de tipo predictivo, de clasificación o regresión lineal. Para ello, estos últimos necesitan de un conjunto de datos etiquetados con sus correspondientes valores respuesta. A este conjunto de datos se le suele denominar conjunto de entrenamiento. Y en muchas ocasiones no es posible disponer de un conjunto de datos suficiente para poder entrenar algoritmos de este tipo.\nSi comparamos esta última forma de aprendizaje automático con la forma en la que los humanos aprendemos conceptos, las diferencias son notables. Un niño aprende a reconocer visualmente un gato y adquiere este concepto sin necesidad de haber visto previamente mil ejemplos diferentes de gatos. Sin embargo, para que un sistema automático pueda detectar un gato en una imagen habitualmente necesita ser entrenado con cientos o miles de imágenes diferentes de ejemplo: imágenes de gatos, desde diferentes ángulos, posiciones y condiciones de iluminación.\nDesde el punto de vista técnico, una de las tareas más importantes cuando nos enfrentamos a un problema de aprendizaje automático, es la extracción de características relevantes, habitualmente denominada en inglés como Feature Engineering. Consiste en encontrar formas de representación de los datos originales que permitan maximizar los resultados del modelo o algoritmo de aprendizaje automático empleado.\nHasta ahora no se habían encontrado métodos automáticos lo suficientemente eficaces como para compararse o mejorar la habilidad de un buen Data Scientist. Sin embargo uno de los mayores éxitos de los métodos de Deep Learning ha sido precisamente el aprendizaje automático de buenas formas de representación de datos de entrada no etiquetados. Lo que se conoce como Unsupervised Feature Learning.\nEl regreso de las redes neuronales\nEl Deep Learning se puede interpretar como un avance en el ámbito del aprendizaje automático en la dirección de la Inteligencia Artificial. Aunque, por otra parte, también es una vuelta atrás o revisión de tecnologías como las redes neuronales que habían tenido su momento de gloria años atrás pero que, desde entonces, habían caído en desuso.\nHoy en día, entre las principales tecnologías relacionadas con Deep Learning, se encuentran diversos tipos de modelos de redes neuronales como las Restricted Boltzmann machines (RBM), los autoencoders, o las Redes Neuronales Convolucionales (ConvNet). Estas redes se caracterizan por disponer de un número elevado de capas intermedias de nodos. Por ello, hay quien interpreta el calificativo Deep Learning simplemente como una forma novedosa de renombrar a las redes neuronales.\nRed neuronal artificial multicapa\nPor otro lado, aunque el uso del término red neuronal puede llevarnos a pensar que hay grandes semejanzas con el funcionamiento del cerebro humano, esta analogía puede resultar engañosa. En esencia, las redes neuronales artificiales son abstracciones que imitan, solo en parte, el funcionamiento de las neuronas humanas.\nDeep Learning is for cats\nImagen de un gato regenerada por la librería ConvNetJS\nEl proyecto Google Brain, liderado por Andrew Ng, uno de los cofundadores de Coursera ha generado una red neuronal que aprende a clasificar el contenido de imágenes no etiquetadas tomadas directamente de vídeos de Youtube. Concretamente, utilizaron un cluster de 1.000 máquinas (16.000 cores) para procesar imágenes extraídas de 10 millones de vídeos. Consiguieron más de un 80% de acierto en la detección de caras humanas y cerca de un 75% detectando gatos. Os dejamos más detalles sobre el procedimiento y resultado de Google Brain.\nPor otro lado, los dos primeros clasificados en la competición de Kaggle “Dogs vs Cats” emplearon librerías de Deep Learning. Logrando un grado de acierto cercano al 99%.\nLa siguiente demo muestra un ejemplo del funcionamiento en tiempo real de ConvNetJS. ConvNetJS es una librería Javascript para el entrenamiento de modelos de Deep Learning desde el navegador. En este ejemplo una red neuronal convolucional implementada completamente en Javascript permite clasificar imágenes entre 10 categorías diferentes, con niveles de acierto que llegan al 80%. Las categorías a identificar se corresponden con los conceptos de avión, coche, barco, camión, pájaro, ciervo, perro, rana, caballo… y gato.\nImagen: research.google.com\n", "date": "2015-02-02T11:34:24+00:00", "slug": "\n\t\t\tdeep-learning,-el-resurgir-de-las-redes-neuronales\t\t\n\t"}, {"author": "Patricia Gonzalez", "url": "http://www.beeva.com/beeva-view/realidad-virtual-en-el-sector-sanitario-deporte-y-turismo/", "image": "http://www.beeva.com/wp-content/uploads/2015/05/BEEVA-realidadvirtual-casos.jpg", "title": "\n\t\t\tRealidad virtual en el sector sanitario, deporte y turismo\t\t\n\t", "id": 18, "content": "\nCuando hablamos de realidad virtual, lo primero que se nos viene a la cabeza son su aplicación en películas o en videojuegos pero, hoy en día, los avances tecnológicos han hecho que la realidad virtual llegue a sectores tan cotidianos como el sanitario, el deporte o el turismo.\nEn este artículo te contamos varios casos de uso.\nGafas de realidad virtual para víctimas de Ictus\nImagen: Yann Bruta para Bloombert BusinessWeek\nLa Federación Mundial de del Corazón estima que cerca de 15 millones de personas sufren accidentes cerebrovasculares cada año.\nLa empresa suiza MindMaze ha creado unas gafas de realidad virtual que, combinándolas con el software de ejercicios y otros juegos, pueden ayudar a los pacientes con ictus a activar su cerebro y recuperar la función motora más rápido que con la terapia física tradicional.\nUna cámara de detección de movimiento proyecta el avatar de un paciente en sus gafas de realidad virtual o a una pantalla de PC. A través de unos 32 electrodos colocados en la cabeza, el paciente puede mandar su brazo virtual para levantar un vaso o dar una patada con su pierna virtual. Estos ejercicios engañan al cerebro del paciente activando sus neuronas y las áreas del cerebro dañadas.\nEn un ensayo clínico de 20 personas, los pacientes que utilizaban este equipo durante 2 horas y media al día durante 3 semanas mejoraron su función motora hasta un 33%.\nMáscara de realidad virtual que simula el buceo en el fondo marino\nImagen: remotte.com\nLa empresa española Remotte ha lanzado Nautilius VR, una máscara para practicar esnórquel permitiéndote nadar y bucear en un fondo marino simulado.\nEsta máscara se compone de un sencillo sistema de lentes similar al de las Google Cardboaard o a las Samsung Gear VR. Nautilius VR tiene una carcasa de policarbonato y polipropileno para introducir el móvil inteligente. También se añade un novedoso sistema de respiración que cubre toda la cara. Solo es necesario descargarse la app en un teléfono inteligente cuya pantalla tenga de 4.7 a 5.2″.\nLas imágenes se coordinan perfectamente con el buceador bajo el agua. Además de su uso deportivo y de ocio, próximamente podrá aplicarse el uso de esta máscara para tratar fobias, sesiones de rehabilitación o fisioterapia.\nTeletransporte con hoteles Marriott\nImagen: travel-brilliantly.marriott.com\nEn el turismo algunos proyectos están empezando a experimentar con visitas virtuales para sentir nuevas experiencias y atraer a futuros clientes como es el ejemplo de la cadena de hoteles Marriott que ha lanzado un proyecto innovador para que los usuarios puedan experimentar viajes virtuales gracias a las gafas de realidad virtual Oculus Rift DK2, unos auriculares y un conjunto de elementos sensoriales 4D que consiguen mayor sensación de inmersión.\nLas personas que utilizan este teletransportador escuchan, ven y sienten lo mismo que si estuvieran en otro lugar del mundo.\nPor ejemplo, en una de las experiencias, primero visitan de forma virtual un nuevo vestíbulo de un hotel de la cadena y luego viajan a una playa de Hawai o a la cima de un rascacielos de Londres, percibiendo las mismas sensaciones que si estuviera realmente allí.\nGracias a esta experiencia, la marca está adoptando tecnologías que darán forma al futuro de los viajes y seducir a los viajeros a explorar y descubrir el mundo.\nA través de estos ejemplos vemos cómo la realidad virtual está cada vez más presente en nuestro día a día.\nHace unos meses te contábamos algunos proyectos que aumentan la experiencia gracias a Oculus Rift (Proyectos que aumentan la experiencia en Oculus Rift), pues como curiosidad, ahora Facebook ha comprado esta empresa de realidad virtual ensalzando así el interés de muchas empresas por la innovación y la realidad virtual.\nImagen: iq.intel.co.ae\n", "date": "2015-05-07T12:03:50+00:00", "slug": "\n\t\t\trealidad-virtual-en-el-sector-sanitario,-deporte-y-turismo\t\t\n\t"}, {"author": "Mario Aguado", "url": "http://www.beeva.com/beeva-view/tecnologia/anade-seguridad-elastichsearch-con-el-plugin-shield/", "image": "http://www.beeva.com/wp-content/uploads/2015/04/BEEVA-seguridad-users.png", "title": "\n\t\t\tAñade seguridad a Elastichsearch con el plugin Shield\t\t\n\t", "id": 19, "content": "\nUno de los problemas que tenía Elasticsearch era su falta de seguridad empresarial y perfilado de usuarios, cualquiera con acceso a un índice podía ver y operar sobre el resto.\nActualmente existe una solución para limitar el acceso a los índices y al cluster, esta consiste en la instalación de un plugin llamado Shield. Lamentablemente es una solución con licencia aparte, aunque por suerte tenemos 30 días para probar y experimentar con él.\nEsta solución está integrada con el resto de soluciones de elastic como son KIBANA, MARVEL, LOGSTASH,…\nEl plugin permite añadir a Elasticsearch:\n\nUsuarios y roles.\nComunicaciones cifradas.\nAuditoría de acceso.\nFiltrado de IPs.\n\nDebemos instalar primero la licencia:\n\nY posteriormente el plugin:\n\nComo parte de la instalación se instalan ejecutables en $ES_HOME/bin/shield y configuraciones en un directorio Shield dentro de la configuración de Elastic. Una vez instalada debemos reiniciar el cluster.\nPara la configuración del plugin se utiliza tanto el fichero elasticsearch.yml como los ficheros del directorio Shield.\nShield permite tres formas de autenticar usuarios, estas se denominan realms y son esusers, ldap y active_directory. Se pueden usar por separado o definiendo un orden de búsqueda de usuarios configurando en elasticsearch.yml el parámetro shield.authc.realms\nPara crear usuarios y asignarlos a roles se realiza con la herramienta esusers.\n\nCon esto se ha añadido el usuario es_admin y asignado el role admin. Este role es uno de los que vienen en la configuración del plugin por defecto que se encuentra definida en $ES_HOME/config/shield/roles.yml en formato YAML.\n\nadmin:\ncluster: all\nindices:\n‘*’: all\n\nUna vez ejecutado esusers ElasticSearch tarda, por defecto, 5 segundos en refrescar los cambios en caché. Una vez pasados esos segundos si intentamos ejecutar comandos sobre el cluster no devuelve error.\n\nSi nos autenticamos con usuario y contraseña comprobamos que nos permite realizar las acciones.\n\nComo parte de Shield, además, se puede añadir: seguridad y cifrado de las comunicaciones entre nodos, autenticación de los nodos que se incorporan en el cluster y auditoría.\nPor último una cosa importante que debemos tener en cuenta es que necesitamos replicar las configuraciones en todos los nodos del cluster cada vez se hayan realizados cambios.\nCon la utilización de este plugin conseguiremos añadir la seguridad y perfilado de usuarios necesarios en cualquier organización.\nSi os interesa el tema, os dejo más información con la guía de Shields y la información de producto.\nImagen: www.jisc.ac.uk (con derechos de reutilización)\n", "date": "2015-04-30T10:41:32+00:00", "slug": "\n\t\t\tañade-seguridad-a-elastichsearch-con-el-plugin-shield\t\t\n\t"}, {"author": "Miguel Rojas", "url": "http://www.beeva.com/beeva-view/tecnologia/monit-una-util-herramienta-para-monitorizar-sistemas-informaticos/", "image": "http://www.beeva.com/wp-content/uploads/2015/04/BEEVA-monit-tools-it.png", "title": "\n\t\t\tMonit, una útil herramienta para monitorizar sistemas informáticos\t\t\n\t", "id": 20, "content": "\nCuando alguien mantiene un entorno grande, lo último que espera es que se caiga. Para evitarlo, la monitorización puede ser un gran aliado.\nLos objetivos de una infraestructura de monitorización de sistemas informáticos son principalmente la prevención de incidencias y conocer el aprovechamiento de los recursos TIC disponibles. Dado que estos objetivos son importantes en cualquier entidad independientemente de su tamaño, es evidente que toda organización debería contar con su propio sistema de monitorización.\nCon este propósito se utiliza Monit.\nMonit es una herramienta gratuita y de código abierto para Unix y Linux, con la que el estado del sistema puede ser visualizado directamente desde la línea de comandos.\nCon Monit se pueden monitorizar:\n\nArchivos\nDirectorios\nDiscos\nProcesos\nSistemas de almacenamiento\nHosts\n\nDe forma adicional a la línea de comandos, Monit también provee una interfaz web ligera que se puede usar para ver el estado de todos los servicios monitorizados:\n\nLa popularidad de Monit ascendió con Ruby on Rails y el servidor web Mongrel, porque se necesitaba una herramienta que pudiera manejar todos los procesos idénticos de Mongrel, que necesitaban estar corriendo para soportar un site escalable con Ruby on Rails, y Monit era adecuado para la comunidad Ruby on Rails.\nMuchas plataformas Rails han usado Monit incluyendo Twitter y Scribd.\nLa facilidad tanto de configuración como de uso de esta herramienta son las que han hecho que progrese en el mercado, además de su versatilidad, pues soporta muchos de los protocolos más populares: HTTP, SMTP, FTP, LDAP, NTP, SSH, SIP, IMAP, POP, DNS etc.\nLa versatilidad de uso de esta herramienta también se hace visible en su adaptabilidad a entornos de diferente clase, como Storm y RabbitMQ.\n\nComo configuración para saber si tu web está operando bien pondremos un breve ejemplo:\n\nLeyenda de comandos:\n1. Conecta y testea el host mmonit.com\n2. Testea usando el protocolo HTTP, y si falla, levanta una alerta\n3. Haz lo mismo usando HTTPS\nEste es solo un pequeño ejemplo de las utilidades que puede aportar Monit. Es una herramienta muy polivalente, por lo que las ventajas de su aplicación deberíamos considerarlas antes de definir una estructura de monitorización. Si has tenido la oportunidad de probar Monit, te invito a que compartas tu experiencia con nosotros.\nImagen: mmonit.com\n", "date": "2015-04-29T10:22:03+00:00", "slug": "\n\t\t\tmonit,-una-útil-herramienta-para-monitorizar-sistemas-informáticos\t\t\n\t"}, {"author": "Jorge Fernandez", "url": "http://www.beeva.com/beeva-view/productividad-empresa/el-arte-de-dominar-la-gestion-de-tu-tiempo-parte-2/", "image": "http://www.beeva.com/wp-content/uploads/2014/10/BEEVA-gestion-tiempo-2.png", "title": "\n\t\t\tEl arte de dominar la gestión de tu tiempo (p.2)\t\t\n\t", "id": 21, "content": "\nEn el anterior os hablé de la importancia de gestionar nuestro tiempo y estimar nuestras tareas. Ahora, os doy claves para saber cómo valorar nuestro tiempo.\nValorar cuanto tiempo voy a tardar en realizar algo se basa en:\n\nSaber qué es lo que tengo que hacer. Si no conocemos bien qué debemos hacer, podemos estimar por lo alto en tiempo para tener en cuenta el nivel de indeterminación existente, o incluso poner una tarea previa que nos sirva para obtener mayor detalle del objetivo.Por ejemplo, si he quedado con una persona en un sitio de Madrid al que no se llegar, debo aparcar y no conozco la zona, saldré hacia allá a una hora que incluya esa indeterminación o buscaré previamente en un GPS por dónde ir, y cuánto se tarda. Esto evitará la espera innecesaria, excusas sobre el tráfico, etc… Si es un cliente, el valor es aún mayor. Si es una entrevista de trabajo, no tiene valor ;).\nSaber cuándo voy a poder decir que la tarea está acabada. Como se decía en la obra “El Cavernícola”, las mujeres y los hombres no son iguales; la idea de una cocina recogida para cada uno es muy diferente. En la vida real todo es igual, lo que para mí ya está acabado, para otro no lo está (las expectativas son diferentes). Cuando se realizan tareas individuales, somos nosotros mismos los que decidimos cuándo está terminada una acción, por la razón que queramos (tiempo invertido, cansancio, empieza un programa de televisión que queremos ver, etc.). Cuando realizamos una tarea en equipo, el decidir qué alcance tendrá una acción es vital para poder estimarla y comunicarla al resto del equipo (un equipo puede estar formado por tu pareja y tú mismo). Si no se habla acerca de cuando se da por acabada, estaremos estimando el alcance que cada miembro del equipo tiene en su cabeza, pero quizás la unión de todas las tareas no formen un todo.Si volvemos al ejemplo del Cavernícola, la idea que tiene un hombre de cocina recogida no es la misma que la que tiene una mujer, y por tanto las estimaciones serán muy diferentes, la de una que la del otro. En caso de poner en común qué condiciones deben de cumplirse para dar por finalizada una tarea, las estimaciones serán más parecidas y habremos gestionado las expectativas del equipo. En el mundo laboral, ocurre continuamente que una tarea de equipo se alarga en el tiempo por no haber tratado su alcance. Por ejemplo, al generar un documento PPT entre varias personas, para unos sólo pensarán en generar el contenido, mientras que para otros también incluirán en su estimación darle el formato adecuado. Si no se habla, el día de la entrega de cada parte, tendremos un documento con contenido, pero sin formatear de la misma forma, y por lo tanto, NO ENTREGABLE al cliente o al jefe al que va dirigido. Si se hubiera tratado previamente, posiblemente la estimación de tiempo de aquellos que no tuvieron en cuenta dar el formato adecuado, habría variado, o se hubiera puesta una tarea adicional para dar formato a todos los contenidos del documento, cerrándose así todas las subtareas de la tarea buscada.\nSer capaz de dividir la tarea, si es compleja, en varias. Para poder llevar a cabo una estimación, y que sea “lo menos a dedo posible”, debemos simplificar las tareas a estimar, generando un árbol de subtareas asociadas a la tarea, que todas unidas nos permitan conseguirla. Cada subtarea podrá seguirse dividiendo hasta que lleguemos a algo valorable en tiempo, gracias a nuestra experiencia o a la de otros. En caso de no ser capaces de poder dividir una tarea, si la estimación es muy grande en tiempo, deberemos tener en cuenta el conocimiento que tengamos sobre la misma, para introducir un valor extra más o menos grande de incertidumbre.\nExperiencia con este tipo de tareas. Tanto individualmente como en equipo, las estimaciones suelen ser más certeras a razón del conocimiento que tienen en realizarse un mismo tipo de acciones. El aprendizaje es algo muy valioso para las estimaciones, que puede mejorar nuestra gestión del tiempo y hacernos adelantarnos a los imprevistos.Por ejemplo, todos los días tardo unos 30 minutos desde casa hasta la oficina en coche, por lo que puedo ponerme reuniones a las 9:30 de la mañana, si es que siempre salgo de casa a las 09:00. Si tras tres lunes, aprendo que por los motivos que sean, esos días he tardado 45 minutos, puedo reorganizar mi agenda y saber que no debo ponerme reuniones los lunes a las 09:30, o estimar que los lunes debo salir de casa a las 08:45.\n\nCuidado con ser muy lanzados\nA través de la experiencia y análisis del comportamiento de los miembros de los equipos de los que he formado parte, todos tendemos a ser muy laxos cuando realizamos la estimación de una tarea, sobre todo al principio de nuestras carreras o por el desconocimiento de la complejidad o subtareas ocultas y que desconocemos; también por intentar agradar al resto del equipo. Por ello, suele ser una buena práctica el uso de un valor de incertidumbre, usado en mayor o menor valor dependiendo de la experiencia con un tipo de tarea.\nPor ejemplo, si quiero modificar solo el color de fondo de un portal web, cambiando sus páginas de estilos, posiblemente suponga que debe ser una tarea muy sencilla, aunque no conozca la tecnología, por lo que aunque piense que deben ser los típicos ‘5 minutos’, mi estimación no debe ser tal, teniendo en cuenta que no sé manejar muy bien los CSS’s “esos” ;). En este caso, mi porcentaje de incertidumbre deberá ser alto, al menos del 200%, por lo que si pienso que son 5’, como poco no me comprometeré con alguien o conmigo mismo en 10’. Si lo hago, lo más seguro es que en ese tiempo no sepa por dónde empezar.\n\nEn definitiva, continuamente nos oímos u oímos decir ‘No tengo tiempo para nada’… lo cual viene dado por nuestras elecciones y deseos de realizar tareas en el tiempo que disponemos (24 horas cada día). Hay personas que lo gestionan mejor que otras, a las que todos ‘envidiamos’ por lo bien que se organizan.\n¿Cómo te lo gestionas tú?\nImagen: IM Creator / anieto2k\n", "date": "2014-10-01T11:03:04+00:00", "slug": "\n\t\t\tel-arte-de-dominar-la-gestión-de-tu-tiempo-(p.2)\t\t\n\t"}, {"author": "Jorge Fernandez", "url": "http://www.beeva.com/beeva-view/productividad-empresa/el-arte-de-dominar-la-gestion-de-tu-tiempo-parte1/", "image": "http://www.beeva.com/wp-content/uploads/2014/09/BEEVA-gestion-tiempo.png", "title": "\n\t\t\tEl arte de dominar la gestión de tu tiempo (p.1)\t\t\n\t", "id": 22, "content": "\nTanto en el ocio como en el negocio, la gestión del tiempo es una habilidad que permite a cualquier persona disponer de ‘huecos’ para llevar a cabo aquello que quiere realizar. Como todos sabemos, el tiempo es finito y pasa inexorablemente, por lo que el poder controlarlo según nuestros intereses, es una tarea compleja que puede llevarnos a mejorar nuestra vida, tanto laboral como privada.\nLa gestión del tiempo es un arte cuya base es la estimación de tareas. Al realizar una estimación, damos un valor temporal a la realización de una tarea, de manera que podemos empezar a gestionar la tarea en el tiempo, jugando con cuándo la hacemos, para cuándo la necesitamos e incluso qué persona la puede realizar (si tenemos posibilidad de delegarla).\nCon la gestión del tiempo, a través de la estimación, podremos llegar a ser más efectivos (hacer las cosas adecuadas en cada momento) por encima de ser eficientes (hacer las cosas bien), pues hacer las cosas bien, si no son cosas que debíamos hacer en un momento dado, no sirve para nada. Por ejemplo, equivocarnos de ruta en una carrera, por mucho que corramos más que los demás participantes, no nos llevará a ganarla. La eficiacia es un valor a tener muy en cuenta y a través de la estimación podremos gestionarla.\nTarea\nAntes de comenzar, dejaremos claro que una estimación no es más que una ‘apuesta’ del tiempo que pensamos que vamos a invertir en llevar a cabo una cierta tarea a realizar; cualquier valor dado, es mejor que nada, pues comenzar a ejecutar una tarea sin sopesar anteriormente cuál es su alcance no nos permitirá gestionarla y, por tanto, es posible que no hayamos elegido el mejor momento disponible. Ésta premisa la podemos tener presente a lo largo de cualquier día en nuestra vida personal y profesional y tratar de realizar tareas individuales, pareja o en equipo (familiares incluso) en el mejor momento posible del día, del fin de semana o de la semana completa.\n‘Tarea’ puede ser, generar un documento de texto como este propio artículo, llevar a cabo una presentación comercial en equipo, limpiar y organizar la casa, prepara la cena para tu familia o preparar las maletas para un viaje.\nDivide y vencerás\nEl secreto para poder estimar una tarea cualquiera es usar la técnica “Divide y Vencerás”, para poder realizar pequeños y rápidos análisis de acciones lo más acotadas posibles. Dependiendo de lo compleja que sea la tarea, será necesario dividir en mayor o menor profundidad, hasta llegar a un punto en el cual nos sintamos cómodos para poder dar y argumentar el porqué se da un valor temporal a realizar una cierta acción, ya sea en horas, días o incluso semanas.\nCuando se quiere conseguir un objetivo medianamente complejo, por lo general se puede realizar una división de tareas, que todas unidas, hacen el todo. Estimar pequeñas tareas hace que el riesgo de equivocación sea menor, tanto por pasarnos como por quedarnos cortos.\nPor ejemplo, para tener limpia una casa podemos tener en cuenta que podemos quitar el polvo, organizar, barrer y fregar todas las habitaciones. Por cada una de las habitaciones, podemos tener por lo tanto 4 tareas. Para poder estimar cuánto tiempo vamos a tardar en limpiar la casa, será más sencillo estimar cuánto vamos a tardar en cada tarea que en todo el conjunto. Además, seguramente el desvío sea menor. Si tenemos esto en cuenta, quizás podamos valorar si es mejor hacer las 4 tareas de una habitación seguidas, y acabar con una habitación, que hacer la tarea de quitar el polvo de todas las habitaciones y dejar sin hacer todo lo demás, ya que no habíamos tenido en cuenta que sólo teníamos 2 horas por delante para hacerlo.\nCómo se estima\n¿Qué debo hacer para estimar? Una vez que tenemos tareas pequeñas, la verdad es que simplemente debe ‘opinarse’ cuanto tiempo te llevaría si tuvieras que hacerla tú, con tu conocimiento actual y las herramientas que tengas. En caso de estar dentro de un equipo, esa opinión debe ser argumentable, por si se nos solicita (en caso de hacer planificaciones en equipo, se suele pedir a cada miembro que de su estimación y argumentos, para que entre todos se detecte el alcance de la tarea). Por tanto, el ejercicio de estimar en sí es muy fácil, ya que solo es asignar una número de horas, o tardes o días a una tarea específica, y además, hacerlo de forma rápida (en menos de un minuto).\n¿Para qué es importante realizar una valoración rápida del tiempo que vamos a invertir en hacer tareas? Como se comentaba en la introducción, debemos tener siempre presente el tiempo disponible que tenemos casi cada día, para ser capaces de anticiparnos a aquellas tareas que podremos abordar y, más importante, a aquellas que no. La gestión del tiempo a través de la división de nuestro tiempo disponible en pequeños fragmentos nos permitirá no sólo saber qué podremos hacer cada día, sino también conocer qué podemos dejar para más adelante y avisar a otros implicados que haya con dicha tarea. Esta última acción es algo que se valora muy positivamente, ya que permite adelantarse a las esperas y expectativas de otra persona, y también a esa otra persona le ayuda a reorganizarse.\nPor ejemplo, si no voy a poder pasar por el Centro Comercial para comprar el regalo de cumpleaños de un amigo (pues pensé que daría tiempo), que es dentro de dos días, y lo aviso con tiempo, quizás otro amigo pueda ir en mi lugar.\nEn la segunda parte de este artículo os doy algunas claves para valorar nuestro tiempo. Espero que os sea útil.\nImagen: IM Creator / anieto2k\n", "date": "2014-09-19T10:14:50+00:00", "slug": "\n\t\t\tel-arte-de-dominar-la-gestión-de-tu-tiempo-(p.1)\t\t\n\t"}, {"author": "Javier Sanabria", "url": "http://www.beeva.com/beeva-view/estrategia-negocio/el-gobierno-en-la-organizacion-analisis-y-buenas-practicas/", "image": "http://www.beeva.com/wp-content/uploads/2015/03/BEEVA-gobiernoIT.jpg", "title": "\n\t\t\tEl gobierno IT en la organización: análisis y buenas prácticas\t\t\n\t", "id": 23, "content": "\nEl uso de TI dentro de cualquier organización conlleva la probabilidad de que se exponga la empresa a riesgos propios del uso de la tecnología, así pues se busca que las organizaciones cuenten con mecanismos de gestión de riesgos que les permitan mantener unos niveles de riesgo adecuados, ya que se hace imposible tener un nivel cero de riesgos, lo que se busca es hacer frente a dichos riesgos de una manera organizada, consensuada bajo en marco común de actuación y que encaje dentro del marco de Gobierno TI de la organización.\nEn la imagen a continuación podemos observar la relación existente entre TI, Gobierno de TI y riesgos, en este contexto se debe proponer un marco para la gestión de riesgos que ayude a cumplir con los objetivos del gobierno de TI y brinde herramientas de gestión de riesgos a las organizaciones.\nRelación entre TI, Gobierno de TI y Riesgos\nEl marco propuesto se puede observar en la segunda imagen a continuación, el cuál se compone de cinco fases interrelacionadas y que depende una de otra. Este marco se plantea como un proceso cíclico en constante evaluación donde se monitorizan los riesgos, se evalúa la eficacia de las medidas implementadas para el tratamiento de dichos riesgos y se realizan los ajustes necesarios.\nEste marco está fundamentado en marcos y metodologías de amplio reconocimiento, como son COBIT, Risk IT, ISO 38500, Magerit, entre otras.\nMarco propuesto para la gestión de riesgos.\nEl proceso se inicia con la revisión de los procesos de negocio, esto con el objetivo de tener una visión general del negocio y de todos aquellos procesos donde interviene TI, de tal manera que se puedan identificar los riesgos asociados a cada proceso y se tenga una amplia cobertura del negocio para poder responder de forma integral a los riesgos a los que se enfrenta la organización.\nEstos procesos deberían existir, estar documentados e implementados como buena práctica dentro del Gobierno de TI. De no existir estos procesos, deben ser desarrollados ya que son la entrada a la fase de análisis de riesgos.\nCada proceso se debe analizar detalladamente identificando claramente como TI interviene en el proceso y cómo lo soporta, identificando los flujos de información con otros procesos, además se debe valorar la criticidad del proceso dentro de la organización.\nComo resultado de esta fase se obtendrá un mapa de los procesos de la organización, documentado de acuerdo a los anteriores criterios, de tal forma que se pueda visualizar fácilmente los riesgos existentes en cada proceso y las posibles áreas de mejora.\nUna vez se han identificado y analizado los procesos de negocio se procede a realizar el análisis de riesgos propiamente dicho a cada uno de los procesos, entendiéndose este tal y como se define en Magerit Versión 3.0, como el “Proceso sistemático para estimar la magnitud de los riesgos a que está expuesta una Organización”.\nEl objetivo de esta fase es identificar, evaluar y estimar los riesgos a los que está expuesta la organización, y así tomar las medidas necesarias para tratar dichos riesgos; el análisis de riesgos se abordará de una forma organizada por cada proceso identificado.\nDe forma general, y sin hacer referencia a una metodología particular, el análisis de riesgos sigue los siguientes pasos:\n\nDeterminación de los activos relevantes para la Organización.\nValoración de los activos identificados.\nDeterminar las amenazas a las que están expuestos los activos.\nEstimar el impacto de la amenaza.\nCalcular el nivel de riesgo. Estimar el riesgo.\n\nUna vez concluida esta fase se obtendrá un mapa de los riesgos identificados por procesos y se tendrá una visión general de los riesgos a los que está expuesta la organización.\nPosterior al análisis de riesgos y habiendo obtenido como resultado final un mapa de los riesgos, se procede a la fase de gestión de riesgos.\nEl objetivo de esta fase es tomar decisiones en cuanto al tratamiento de los riesgos y generar las estrategias necesarias para dicho tratamiento de tal forma que se reduzca al mínimo su potencialidad o los posibles perjuicios que puedan generarse.\nLa gestión de riesgos de forma general, y sin hacer mención a una metodología particular, puede seguir las siguientes fases:\n\nDeterminación de los criterios de aceptación del riesgo.\nDeterminación de las medidas de seguridad necesarias (establecimiento de salvaguardas).\nEstimación del impacto residual.\nEstimación del nivel de riesgo residual.\n\nUna vez finalizada esta fase se obtendrá un plan de tratamiento de riesgos, donde se establecen las salvaguardas y controles a implantar para hacer frente a los riesgos identificados.\nUna vez culminada la fase de gestión de riesgos se procede a la definición de Indicadores Claves de Riesgo KRI (Key Risk Indicator). Los KRI son parámetros que miden los riesgos en los procesos y actividades de negocio y provee una alerta temprana de sus posibles consecuencias nocivas.\nEl objetivo de definir estos indicadores es supervisar los riesgos y evaluar la eficacia de los controles implantados, como un mecanismo de seguimiento constante.\nPara la definición de los KRI, como se indica en “The Risk IT Framework” se deben tener en cuenta, entre otros, los siguientes pasos:\n\nConsiderar las distintas partes interesadas en la empresa. Los indicadores de riesgos deben no solo centrarse en las operaciones o en la parte estratégica de riesgo, pueden y deben ser identificados para todas las partes interesadas. La participación de los interesados adecuados en la selección de indicadores de riesgo también deberá garantizar una mayor aportación y adecuación de los mismos.\nHacer una selección equilibrada de indicadores del riesgo, cubriendo indicadores de los resultados (indicando el riesgo después de que hayan ocurrido los hechos), indicadores principales (lo que indica que las capacidades están en el lugar apropiado para evitar que se produzcan acontecimientos) y las tendencias (análisis de indicadores en el tiempo o la correlación de los indicadores para obtener información).\nAsegurar que los indicadores seleccionados detallen el origen de la causa de los eventos (indicación del origen y no solo los síntomas)\n\nSi bien una organización puede identificar un amplio número de métricas, estas deben cumplir una serie de características para ser seleccionadas como KRI, entre estos criterios se tiene:\n\nImpacto: los indicadores de riesgo con alto impacto en el negocio son más susceptibles de ser KRI.\nEsfuerzo para aplicar, medir y reportar: los indicadores que son equivalentes en sensibilidad, deben ser fáciles de medir.\nFiabilidad: el indicador debe poseer una alta correlación con el riesgo y ser un buen predictor o medidor del resultado.\nSensibilidad: el indicador debe ser representativo para el riesgo y capaz de indicar con precisión las variaciones en el riesgo.\n\nLa adecuada selección de los KRI’s proporcionará los siguientes beneficios a la organización:\n\nProporcionar una alerta temprana: señal de que un alto riesgo está surgiendo para permitir a la administración adoptar medidas proactivas (antes de que el riesgo se convierte en una pérdida).\nProporcionar una opinión retrospectiva sobre los acontecimientos de riesgo que han ocurrido, permitiendo respuestas de riesgo y la gestión de su mejora.\nFacilitar la documentación y el análisis de las tendencias.\nProporcionar indicadores a la empresa del apetito de riesgo y la tolerancia a través de la configuración métrica (es decir, los umbrales de KRI).\nAumentar la probabilidad de lograr los objetivos estratégicos de la empresa.\nAyudar continuamente a la optimización de la gestión del riesgo y del entorno.\n\nComo resultado de esta fase se obtendrá un conjunto de Indicadores Claves de Riesgo, detallados y documentados, que permitirán llevar a cabo las tareas de monitorización.\nFinalmente se entra en la fase de monitorización y comunicación de incidencias, cuyo objetivo es hacer seguimiento y evaluación a los riesgos identificados y a la efectividad de los controles implantados, de igual forma se deben establecer mecanismos de comunicación de incidencias que permitan actuar de forma oportuna.\nComo se puede observar el proceso es cíclico y permite hacer una evaluación constante y llevar a cabo los ajustes necesarios de forma oportuna.\nImagen: freedigitalphotos.net / Goldy\n", "date": "2015-03-04T13:34:07+00:00", "slug": "\n\t\t\tel-gobierno-it-en-la-organización:-análisis-y-buenas-prácticas\t\t\n\t"}, {"author": "Eduardo López", "url": "http://www.beeva.com/beeva-view/estrategia-negocio/e-commerce-que-debes-plantearte-para-montar-tu-propia-plataforma/", "image": "http://www.beeva.com/wp-content/uploads/2015/01/BEEVA-ecommerce.jpg", "title": "\n\t\t\tE-commerce: qué tener en cuenta para montar tu propia plataforma\t\t\n\t", "id": 24, "content": "\nEl término e-commerce consiste en la compra y venta de productos o de servicios a través de medios electrónicos, tales como Internet y otras redes informáticas.\nExisten varios ejemplos de sistemas de pago electrónico, como son los sistemas de monedero electrónico, los TPVs o pasarelas de pago virtual para el pago con tarjeta y sistemas de banca electrónica que se conectan directamente con el usuario.\nAunque un 43% de los españoles nunca ha comprado por internet (según datos del CIS) y tan solo un 33% de los españoles ha hecho una compra en internet en el último año (2014), los datos auguran un futuro prometedor.\nEn los próximos 4 años, Europa se consolidará como el continente con mayor volumen de ventas efectuadas a través de Internet, según asegura un estudio realizado a consultora americana Forrester. También apunta dicho estudio que España ocupará un lugar especial a la cabeza de los países que más crecerán dentro de este sector.\nAdemás, el estudio añade que dentro de estas previsiones, el e-commerce español crecerá un 14,4% para facturar unos 12.548 millones de euros, según Observatorio Nacional de las Telecomunicaciones y de la Sociedad de la Información (ONTSI).\nLos sectores que aumentarán sus ventas sus ventas a través del comercio electrónico, con un 47% se aupará a la primera posición por primera vez el sector de la moda. En segunda posición se coloca el sector de viajes seguido de las tecnologías. Otro sector que aumentará bastante su ventas online es el sector de los libros, ya que el 25% de las compras de libros ya se hacen mediante la venta online.\nExisten numerosas webs para realizar las compras online, pero las más destacadas son Amazon (35%), eBay (29%) y Groupon (17%). Los usuarios las prefieren por sus múltiples ventajas, entre las que destacan: precios competitivos, variedad de productos y sencillez en el uso de las páginas.\ne-commerce, plataformas para tiendas online\nPara llevar a cabo e-commerce en nuestro negocio debemos de tener en cuenta un plan de acción, ya que cada negocio y cada estrategia es diferente:\n\nLo más importante a tener en cuenta es que debemos de tener un conocimiento del mercado. Cuando vamos a crear una tienda nos debemos de realizar varias preguntas importante como por ejemplo: cuál es la demanda online de productos o servicios, estudio de competidores, etc.\nOfrecer al cliente un adecuado servicio de asistencia. Este término se conoce como fidelización.\nEs muy importante invertir en invertir en publicidad (campañas de Google Adwords), llevar a cabo operativas de posicionamiento SEO… En definitiva, debemos apostar por el marketing.\nNuestra web debe tener una gran usabilidad: se debe de presentar de manera clara los productos y lo que es más importante, el pedido se debe poder realizar de manera sencilla, con numerosas descripciones del mismo y si se puede acompañar de imágenes aclaratorias mucho mejor.\n\nNo resulta nada fácil elegir la plataforma de e-commerce adecuada para crear tu tienda online con todas las opciones que existen en el mercado.\nDebemos de definir cuáles son las necesidades de nuestra tienda en términos de:\n\n¿Nos basta con un software en la nube o necesitaremos hosting? ¿Las plantillas son responsive?\n¿Necesitaremos crear multitienda o no?\n¿Nuestro software necesitará trabajar el SEO de forma flexible?\nPara la personalización de la tienda, ¿dispongo de multitud de plantillas profesionales?\n¿Voy a tener afiliados o solo voy a vender yo?\n¿Necesitaremos manejar multi idiomas?\n¿Cuál va a ser nuestro volumen de mercado, 50 o 30.000 productos?\nEl stock de nuestra tienda, ¿cómo manejaremos (desde la tienda, desde un ERP…)?\n\nExisten numerosas plataforma de e-commerce en el mercado pero cabe destacar las siguientes:\n\nShopify\nWooCommerce\nPrestashop\nMagento\n\nEn los últimos tiempos, ha surgido una plataforma menos conocida pero que está ganando mercado poco a poco: Oleoshop, que está ganando mercado porque tiene características importantes:\n\nLa principal característica es que esta pensada para poder crear nuestra tienda virtual de la manera más sencilla posible pero sin perder la capacidad de personalizar la misma. Esto se consigue porque han creado un gestor de contenidos basado en piezas. Puedes crear tus página seleccionando una estructura y arrastrando y configurando los diferentes componentes (imágenes, carruseles, imágenes, productos).\nEs un software responsive , es decir adaptado a móviles y tabletas.\nDispone de numerosas plantillas y, lo que es más importante, todas ellas personalizables al máximo.\nDicha plataforma es un servicio en la nube SAAS.\nOleoshop proporciona el alojamiento, monitorización 24 horas y los 7 días de la semana, constantes actualizaciones, copias de seguridad diarias y una característica muy importante, proporciona soporte.\nDispone de gran cantidad de librerías y con tiempos de respuesta muy buenos.\nPor último, cabe destacar que Oleoshop está integrado con Visual Gest, una completa gama de soluciones software orientadas al comercio, a cadenas de tiendas y a franquicias, cubriendo todas las áreas funcionales del negocio, tales como, control remoto de tiendas, TPV, logística y control del inventario, compras, ventas, y finanzas. Módulos avanzados para el textil moda (tallas, colores), alimentación, comercio especializado, venta al detalle y al mayor, restauración y Galatea 4.0.\n\nVistos estos datos y la cada vez mayor facilidad para crear un sitio e-commerce, sin duda queda claro que el e-commer es una apuesta de futuro.\nImagen: freedigitalphotos.net / stockimages\n", "date": "2015-01-29T10:55:15+00:00", "slug": "\n\t\t\te-commerce:-qué-tener-en-cuenta-para-montar-tu-propia-plataforma\t\t\n\t"}]